const chinese_knowlege_dir = [
    {
      "name": "基础知识积累与运用",
      "level": "1",
      "children": [
        {
          "name": "汉字",
          "level": "2",
          "children": [
            {
              "name": "字音",
              "level": "3",
              "children": [
                {
                  "name": "易误读常见字",
                  "level": "4"
                },
                {
                  "name": "多音字",
                  "level": "4"
                },
                {
                  "name": "注音",
                  "level": "4"
                }
              ]
            },
            {
              "name": "字形",
              "level": "3",
              "children": [
                {
                  "name": "常见易错字",
                  "level": "4"
                },
                {
                  "name": "根据拼音写汉字",
                  "level": "4"
                },
                {
                  "name": "汉字临摹",
                  "level": "4"
                },
                {
                  "name": "笔画、笔顺",
                  "level": "4"
                },
                {
                  "name": "字典、词典的使用",
                  "level": "4"
                },
                {
                  "name": "书法字体识别、鉴赏",
                  "level": "4"
                },
                {
                  "name": "汉字的演变和造字法",
                  "level": "4"
                }
              ]
            },
            {
              "name": "字义",
              "level": "3"
            }
          ]
        },
        {
          "name": "词语",
          "level": "2",
          "children": [
            {
              "name": "一般词语",
              "level": "3"
            },
            {
              "name": "成语和熟语",
              "level": "3"
            },
            {
              "name": "关联词语",
              "level": "3",
              "children": [
                {
                  "name": "并列关系",
                  "level": "4"
                },
                {
                  "name": "选择关系",
                  "level": "4"
                },
                {
                  "name": "转折关系",
                  "level": "4"
                },
                {
                  "name": "因果关系",
                  "level": "4"
                },
                {
                  "name": "条件关系",
                  "level": "4"
                },
                {
                  "name": "递进关系",
                  "level": "4"
                },
                {
                  "name": "假设关系",
                  "level": "4"
                }
              ]
            },
            {
              "name": "词义辨析",
              "level": "3"
            },
            {
              "name": "词类（词性）",
              "level": "3",
              "children": [
                {
                  "name": "现代汉语实词",
                  "level": "4"
                },
                {
                  "name": "现代汉语虚词",
                  "level": "4"
                }
              ]
            },
            {
              "name": "短语的结构",
              "level": "3",
              "children": [
                {
                  "name": "并列短语",
                  "level": "4"
                },
                {
                  "name": "偏正短语",
                  "level": "4"
                },
                {
                  "name": "动宾短语",
                  "level": "4"
                },
                {
                  "name": "后补短语",
                  "level": "4"
                },
                {
                  "name": "主谓短语",
                  "level": "4"
                },
                {
                  "name": "介宾短语",
                  "level": "4"
                },
                {
                  "name": "其他短语",
                  "level": "4"
                }
              ]
            }
          ]
        },
        {
          "name": "句子",
          "level": "2",
          "children": [
            {
              "name": "标点符号",
              "level": "3"
            },
            {
              "name": "修辞手法",
              "level": "3"
            },
            {
              "name": "病句辨析与修改",
              "level": "3",
              "children": [
                {
                  "name": "语序不当",
                  "level": "4"
                },
                {
                  "name": "搭配不当",
                  "level": "4"
                },
                {
                  "name": "成分残缺或赘余",
                  "level": "4"
                },
                {
                  "name": "结构混乱",
                  "level": "4"
                },
                {
                  "name": "表意不明",
                  "level": "4"
                },
                {
                  "name": "不合逻辑",
                  "level": "4"
                }
              ]
            },
            {
              "name": "单句的类型",
              "level": "3",
              "children": [
                {
                  "name": "陈述句",
                  "level": "4"
                },
                {
                  "name": "疑问句",
                  "level": "4"
                },
                {
                  "name": "祈使句",
                  "level": "4"
                },
                {
                  "name": "感叹句",
                  "level": "4"
                }
              ]
            },
            {
              "name": "单句的成分",
              "level": "3",
              "children": [
                {
                  "name": "主语",
                  "level": "4"
                },
                {
                  "name": "谓语",
                  "level": "4"
                },
                {
                  "name": "宾语",
                  "level": "4"
                },
                {
                  "name": "定语",
                  "level": "4"
                },
                {
                  "name": "状语",
                  "level": "4"
                },
                {
                  "name": "补语",
                  "level": "4"
                }
              ]
            },
            {
              "name": "复句的类型",
              "level": "3",
              "children": [
                {
                  "name": "并列",
                  "level": "4"
                },
                {
                  "name": "递进",
                  "level": "4"
                },
                {
                  "name": "选择",
                  "level": "4"
                },
                {
                  "name": "转折",
                  "level": "4"
                },
                {
                  "name": "假设",
                  "level": "4"
                },
                {
                  "name": "条件",
                  "level": "4"
                },
                {
                  "name": "因果",
                  "level": "4"
                },
                {
                  "name": "承接",
                  "level": "4"
                }
              ]
            }
          ]
        },
        {
          "name": "语言表达与应用",
          "level": "2",
          "children": [
            {
              "name": "语言表达的要求",
              "level": "3"
            },
            {
              "name": "准确、鲜明、生动",
              "level": "3"
            },
            {
              "name": "简明、连贯、得体",
              "level": "3"
            },
            {
              "name": "选用、变换句式",
              "level": "3"
            },
            {
              "name": "仿写、续写、补写句子",
              "level": "3"
            },
            {
              "name": "衔接与排序",
              "level": "3"
            },
            {
              "name": "图文转换",
              "level": "3",
              "children": [
                {
                  "name": "漫画类",
                  "level": "4"
                },
                {
                  "name": "徽标类",
                  "level": "4"
                },
                {
                  "name": "图表类",
                  "level": "4"
                },
                {
                  "name": "路线示意图、方位图",
                  "level": "4"
                },
                {
                  "name": "思维导图",
                  "level": "4"
                },
                {
                  "name": "流程图",
                  "level": "4"
                }
              ]
            },
            {
              "name": "语言应用场景",
              "level": "3",
              "children": [
                {
                  "name": "对联",
                  "level": "4"
                },
                {
                  "name": "宣传标语",
                  "level": "4"
                },
                {
                  "name": "广告语",
                  "level": "4"
                },
                {
                  "name": "纪念日",
                  "level": "4"
                },
                {
                  "name": "意见建议",
                  "level": "4"
                },
                {
                  "name": "推荐语",
                  "level": "4"
                },
                {
                  "name": "采访词",
                  "level": "4"
                },
                {
                  "name": "情景对话",
                  "level": "4"
                },
                {
                  "name": "朗读（节奏、停顿）",
                  "level": "4"
                },
                {
                  "name": "活动设计",
                  "level": "4"
                },
                {
                  "name": "串联词",
                  "level": "4"
                },
                {
                  "name": "开场白/结束语",
                  "level": "4"
                },
                {
                  "name": "颁奖词",
                  "level": "4"
                },
                {
                  "name": "劝说词",
                  "level": "4"
                },
                {
                  "name": "通知",
                  "level": "4"
                },
                {
                  "name": "启事",
                  "level": "4"
                },
                {
                  "name": "邀请函",
                  "level": "4"
                },
                {
                  "name": "手机短信",
                  "level": "4"
                },
                {
                  "name": "导游词",
                  "level": "4"
                },
                {
                  "name": "地方特色（特产、名胜古迹等）",
                  "level": "4"
                },
                {
                  "name": "辩论词",
                  "level": "4"
                },
                {
                  "name": "日记",
                  "level": "4"
                },
                {
                  "name": "书信",
                  "level": "4"
                },
                {
                  "name": "演讲稿",
                  "level": "4"
                },
                {
                  "name": "申请书",
                  "level": "4"
                },
                {
                  "name": "倡议书",
                  "level": "4"
                },
                {
                  "name": "计划书",
                  "level": "4"
                },
                {
                  "name": "活动总结",
                  "level": "4"
                },
                {
                  "name": "新闻稿",
                  "level": "4"
                },
                {
                  "name": "调查报告",
                  "level": "4"
                },
                {
                  "name": "公约",
                  "level": "4"
                },
                {
                  "name": "通知/启事",
                  "level": "4"
                }
              ]
            },
            {
              "name": "压缩语段、扩展语句",
              "level": "3",
              "children": [
                {
                  "name": "压缩语段",
                  "level": "4"
                },
                {
                  "name": "扩展语句",
                  "level": "4"
                }
              ]
            },
            {
              "name": "文段综合",
              "level": "3",
              "children": [
                {
                  "name": "拟写新闻标题、导语",
                  "level": "4"
                },
                {
                  "name": "提炼与概括",
                  "level": "4"
                }
              ]
            },
            {
              "name": "情境补写",
              "level": "3"
            },
            {
              "name": "文段修改",
              "level": "3"
            }
          ]
        },
        {
          "name": "文章作者",
          "level": "2",
          "children": [
            {
              "name": "中国古代文学",
              "level": "3",
              "children": [
                {
                  "name": "春秋",
                  "level": "4",
                  "children": [
                    {
                      "name": "孔子(前551-前479)",
                      "level": "5"
                    },
                    {
                      "name": "左丘明(前556-前451)",
                      "level": "5"
                    },
                    {
                      "name": "墨子(约前468-前376)",
                      "level": "5"
                    },
                    {
                      "name": "老子(约前570-500)",
                      "level": "5"
                    },
                    {
                      "name": "孙子(约前551-前479)",
                      "level": "5"
                    },
                    {
                      "name": "其他春秋作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "战国",
                  "level": "4",
                  "children": [
                    {
                      "name": "孟子(前372-前289)",
                      "level": "5"
                    },
                    {
                      "name": "庄子(约前369-前286)",
                      "level": "5"
                    },
                    {
                      "name": "荀子(前313-前238)",
                      "level": "5"
                    },
                    {
                      "name": "韩非子(前280-前233)",
                      "level": "5"
                    },
                    {
                      "name": "吕不韦(前292-前235)",
                      "level": "5"
                    },
                    {
                      "name": "列子(约前649-前606)",
                      "level": "5"
                    },
                    {
                      "name": "屈原(约前340-约前278)",
                      "level": "5"
                    },
                    {
                      "name": "宋玉(约前298-前222)",
                      "level": "5"
                    },
                    {
                      "name": "其他战国作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "西汉",
                  "level": "4",
                  "children": [
                    {
                      "name": "贾谊(前200-前168)",
                      "level": "5"
                    },
                    {
                      "name": "司马迁(前145-前90)",
                      "level": "5"
                    },
                    {
                      "name": "刘向(约前77-前6)",
                      "level": "5"
                    },
                    {
                      "name": "其他西汉作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "东汉",
                  "level": "4",
                  "children": [
                    {
                      "name": "班固(32-92)",
                      "level": "5"
                    },
                    {
                      "name": "其他东汉作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "三国",
                  "level": "4",
                  "children": [
                    {
                      "name": "曹操(155-220)",
                      "level": "5"
                    },
                    {
                      "name": "诸葛亮(181-234)",
                      "level": "5"
                    },
                    {
                      "name": "曹丕(187-226)",
                      "level": "5"
                    },
                    {
                      "name": "曹植(192-232)",
                      "level": "5"
                    },
                    {
                      "name": "阮籍(210-263)",
                      "level": "5"
                    },
                    {
                      "name": "其他三国作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "西晋",
                  "level": "4",
                  "children": [
                    {
                      "name": "李密(224-287)",
                      "level": "5"
                    },
                    {
                      "name": "陈寿(233-297)",
                      "level": "5"
                    },
                    {
                      "name": "陆机(261-303)",
                      "level": "5"
                    },
                    {
                      "name": "王羲之(303-361)",
                      "level": "5"
                    },
                    {
                      "name": "西晋其他作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "东晋",
                  "level": "4",
                  "children": [
                    {
                      "name": "陶渊明(365-427)",
                      "level": "5"
                    },
                    {
                      "name": "干宝(283-351)",
                      "level": "5"
                    },
                    {
                      "name": "谢灵运(385-433)",
                      "level": "5"
                    },
                    {
                      "name": "东晋其他作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "南北朝",
                  "level": "4",
                  "children": [
                    {
                      "name": "范晔(398-445)",
                      "level": "5"
                    },
                    {
                      "name": "刘义庆(403-444)",
                      "level": "5"
                    },
                    {
                      "name": "鲍照(约414-466)",
                      "level": "5"
                    },
                    {
                      "name": "陶弘景（456—536年）",
                      "level": "5"
                    },
                    {
                      "name": "谢朓(464-499)",
                      "level": "5"
                    },
                    {
                      "name": "丘迟(464-508)",
                      "level": "5"
                    },
                    {
                      "name": "刘勰(465-520)",
                      "level": "5"
                    },
                    {
                      "name": "钟嵘(约468-518)",
                      "level": "5"
                    },
                    {
                      "name": "吴均（469～520）",
                      "level": "5"
                    },
                    {
                      "name": "郦道元(470-527)",
                      "level": "5"
                    },
                    {
                      "name": "陈叔宝(553年—604)",
                      "level": "5"
                    },
                    {
                      "name": "其他南北朝作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "隋唐",
                  "level": "4",
                  "children": [
                    {
                      "name": "王勃(650-675)",
                      "level": "5"
                    },
                    {
                      "name": "张若虚(约660-约720)",
                      "level": "5"
                    },
                    {
                      "name": "张九龄(678-740)",
                      "level": "5"
                    },
                    {
                      "name": "杨炯(650-692)",
                      "level": "5"
                    },
                    {
                      "name": "卢照邻(约635-约689)",
                      "level": "5"
                    },
                    {
                      "name": "骆宾王(约640-687)",
                      "level": "5"
                    },
                    {
                      "name": "贺知章(659-744)",
                      "level": "5"
                    },
                    {
                      "name": "王之涣(688-742)",
                      "level": "5"
                    },
                    {
                      "name": "孟浩然(689-740)",
                      "level": "5"
                    },
                    {
                      "name": "王昌龄(690-756)",
                      "level": "5"
                    },
                    {
                      "name": "王湾（693－751）",
                      "level": "5"
                    },
                    {
                      "name": "王维(701-761)",
                      "level": "5"
                    },
                    {
                      "name": "李白(701-762)",
                      "level": "5"
                    },
                    {
                      "name": "高适(700-765)",
                      "level": "5"
                    },
                    {
                      "name": "崔颢(704-754)",
                      "level": "5"
                    },
                    {
                      "name": "常建（708－？）",
                      "level": "5"
                    },
                    {
                      "name": "杜甫(712-770)",
                      "level": "5"
                    },
                    {
                      "name": "岑参(715-770)",
                      "level": "5"
                    },
                    {
                      "name": "张志和(730-810)",
                      "level": "5"
                    },
                    {
                      "name": "韦应物(约737-791)",
                      "level": "5"
                    },
                    {
                      "name": "卢纶（739-799年）",
                      "level": "5"
                    },
                    {
                      "name": "李益(750－830)",
                      "level": "5"
                    },
                    {
                      "name": "孟郊(751-814)",
                      "level": "5"
                    },
                    {
                      "name": "韩愈(768-824)",
                      "level": "5"
                    },
                    {
                      "name": "刘禹锡(772-842)",
                      "level": "5"
                    },
                    {
                      "name": "白居易(772-846)",
                      "level": "5"
                    },
                    {
                      "name": "柳宗元(773-819)",
                      "level": "5"
                    },
                    {
                      "name": "白行简(776-826)",
                      "level": "5"
                    },
                    {
                      "name": "元稹(779-831)",
                      "level": "5"
                    },
                    {
                      "name": "贾岛(779-843)",
                      "level": "5"
                    },
                    {
                      "name": "李贺(790-816)",
                      "level": "5"
                    },
                    {
                      "name": "杜牧(803-853)",
                      "level": "5"
                    },
                    {
                      "name": "温庭筠(约812-866)",
                      "level": "5"
                    },
                    {
                      "name": "李商隐(813-858)",
                      "level": "5"
                    },
                    {
                      "name": "罗隐(833-909)",
                      "level": "5"
                    },
                    {
                      "name": "其他隋唐作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "五代十国",
                  "level": "4",
                  "children": [
                    {
                      "name": "韦庄(约836-910)",
                      "level": "5"
                    },
                    {
                      "name": "冯延巳(903-960)",
                      "level": "5"
                    },
                    {
                      "name": "李煜(937-978)",
                      "level": "5"
                    },
                    {
                      "name": "其他五代十国作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "北宋",
                  "level": "4",
                  "children": [
                    {
                      "name": "柳永(约971-1053)",
                      "level": "5"
                    },
                    {
                      "name": "范仲淹(989-1052)",
                      "level": "5"
                    },
                    {
                      "name": "张先(990-1078)",
                      "level": "5"
                    },
                    {
                      "name": "晏殊(991-1055)",
                      "level": "5"
                    },
                    {
                      "name": "宋祁(998-1061)",
                      "level": "5"
                    },
                    {
                      "name": "欧阳修(1007-1072)",
                      "level": "5"
                    },
                    {
                      "name": "苏洵(1009-1066)",
                      "level": "5"
                    },
                    {
                      "name": "周敦颐(1017-1073)",
                      "level": "5"
                    },
                    {
                      "name": "司马光(1019-1086)",
                      "level": "5"
                    },
                    {
                      "name": "王安石(1021-1086)",
                      "level": "5"
                    },
                    {
                      "name": "沈括(1031-1095)",
                      "level": "5"
                    },
                    {
                      "name": "苏轼(1037-1101)",
                      "level": "5"
                    },
                    {
                      "name": "苏辙(1039-1112)",
                      "level": "5"
                    },
                    {
                      "name": "晏几道(约1040-约1112)",
                      "level": "5"
                    },
                    {
                      "name": "黄庭坚(1045-1105)",
                      "level": "5"
                    },
                    {
                      "name": "秦观(1049-1100)",
                      "level": "5"
                    },
                    {
                      "name": "贺铸(1052-1125)",
                      "level": "5"
                    },
                    {
                      "name": "周邦彦(1056-1121)",
                      "level": "5"
                    },
                    {
                      "name": "其他北宋作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "南宋",
                  "level": "4",
                  "children": [
                    {
                      "name": "李清照(1084-1155)",
                      "level": "5"
                    },
                    {
                      "name": "岳飞(1103-1142)",
                      "level": "5"
                    },
                    {
                      "name": "陆游(1125-1207)",
                      "level": "5"
                    },
                    {
                      "name": "杨万里(1127-1206)",
                      "level": "5"
                    },
                    {
                      "name": "朱熹(1130-1200)",
                      "level": "5"
                    },
                    {
                      "name": "张孝祥(1132-1169)",
                      "level": "5"
                    },
                    {
                      "name": "辛弃疾(1140-1207)",
                      "level": "5"
                    },
                    {
                      "name": "姜夔(1155-1221)",
                      "level": "5"
                    },
                    {
                      "name": "翁卷（生卒年不详）",
                      "level": "5"
                    },
                    {
                      "name": "文天祥(1236-1283)",
                      "level": "5"
                    },
                    {
                      "name": "其他南宋作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "元",
                  "level": "4",
                  "children": [
                    {
                      "name": "关汉卿(1220-1300)",
                      "level": "5"
                    },
                    {
                      "name": "王实甫(不详)",
                      "level": "5"
                    },
                    {
                      "name": "马致远(约1251-1321)",
                      "level": "5"
                    },
                    {
                      "name": "雎景臣(不详)",
                      "level": "5"
                    },
                    {
                      "name": "张养浩(1270-1329)",
                      "level": "5"
                    },
                    {
                      "name": "郑光祖(不详)",
                      "level": "5"
                    },
                    {
                      "name": "张可久(约1270-1348)",
                      "level": "5"
                    },
                    {
                      "name": "乔吉(不详)",
                      "level": "5"
                    },
                    {
                      "name": "施耐庵(不详)",
                      "level": "5"
                    },
                    {
                      "name": "其他元代作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "明",
                  "level": "4",
                  "children": [
                    {
                      "name": "宋濂(1310-1381)",
                      "level": "5"
                    },
                    {
                      "name": "刘基(1311-1375)",
                      "level": "5"
                    },
                    {
                      "name": "罗贯中(不详)",
                      "level": "5"
                    },
                    {
                      "name": "于谦(1398-1457)",
                      "level": "5"
                    },
                    {
                      "name": "吴承恩(1507-1582)",
                      "level": "5"
                    },
                    {
                      "name": "归有光(1506-1571)",
                      "level": "5"
                    },
                    {
                      "name": "汤显祖(1550-1616)",
                      "level": "5"
                    },
                    {
                      "name": "袁宏道(1568-1610)",
                      "level": "5"
                    },
                    {
                      "name": "冯梦龙(1574-1646)",
                      "level": "5"
                    },
                    {
                      "name": "凌濛初(1580-1644)",
                      "level": "5"
                    },
                    {
                      "name": "徐弘祖(1586-1641)",
                      "level": "5"
                    },
                    {
                      "name": "魏学洢(约1596-约1625)",
                      "level": "5"
                    },
                    {
                      "name": "张溥(1602-1641)",
                      "level": "5"
                    },
                    {
                      "name": "其他明代作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "清",
                  "level": "4",
                  "children": [
                    {
                      "name": "张岱(1597-1679)",
                      "level": "5"
                    },
                    {
                      "name": "林嗣环（1607－约1662）",
                      "level": "5"
                    },
                    {
                      "name": "李渔(1610-1680)",
                      "level": "5"
                    },
                    {
                      "name": "顾炎武(1613-1682)",
                      "level": "5"
                    },
                    {
                      "name": "魏禧(1624-1681)",
                      "level": "5"
                    },
                    {
                      "name": "蒲松龄(1640-1715)",
                      "level": "5"
                    },
                    {
                      "name": "洪昇(1645-1704)",
                      "level": "5"
                    },
                    {
                      "name": "孔尚任(1648-1718)",
                      "level": "5"
                    },
                    {
                      "name": "查慎行(1650-1727)",
                      "level": "5"
                    },
                    {
                      "name": "纳兰性德(1655-1685)",
                      "level": "5"
                    },
                    {
                      "name": "方苞(1668-1749)",
                      "level": "5"
                    },
                    {
                      "name": "吴敬梓(1701-1754)",
                      "level": "5"
                    },
                    {
                      "name": "全祖望(1705-1755)",
                      "level": "5"
                    },
                    {
                      "name": "曹雪芹(1715-1764)",
                      "level": "5"
                    },
                    {
                      "name": "袁枚(1716-1798)",
                      "level": "5"
                    },
                    {
                      "name": "纪昀（1724－1805）",
                      "level": "5"
                    },
                    {
                      "name": "姚鼐(1732-1815)",
                      "level": "5"
                    },
                    {
                      "name": "李汝珍（1763-约1830）",
                      "level": "5"
                    },
                    {
                      "name": "龚自珍(1792-1841)",
                      "level": "5"
                    },
                    {
                      "name": "其他清代作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "近代",
                  "level": "4",
                  "children": [
                    {
                      "name": "刘鹗(1857-1909)",
                      "level": "5"
                    },
                    {
                      "name": "康有为(1858-1927)",
                      "level": "5"
                    },
                    {
                      "name": "吴趼人(1866-1910)",
                      "level": "5"
                    },
                    {
                      "name": "孙文(1866-1925)",
                      "level": "5"
                    },
                    {
                      "name": "李宝嘉(1867-1906)",
                      "level": "5"
                    },
                    {
                      "name": "章太炎(1869-1936)",
                      "level": "5"
                    },
                    {
                      "name": "曾朴(1872-1935)",
                      "level": "5"
                    },
                    {
                      "name": "梁启超(1873-1929)",
                      "level": "5"
                    },
                    {
                      "name": "王国维(1877-1927)",
                      "level": "5"
                    },
                    {
                      "name": "其他近代作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "其他古代作家",
                  "level": "4"
                }
              ]
            },
            {
              "name": "中国现当代文学",
              "level": "3",
              "children": [
                {
                  "name": "现代",
                  "level": "4",
                  "children": [
                    {
                      "name": "鲁迅(1881-1936)",
                      "level": "5"
                    },
                    {
                      "name": "周作人(1884-1967)",
                      "level": "5"
                    },
                    {
                      "name": "柳亚子(1887-1958)",
                      "level": "5"
                    },
                    {
                      "name": "胡适(1887-1962)",
                      "level": "5"
                    },
                    {
                      "name": "刘半农(1891-1934)",
                      "level": "5"
                    },
                    {
                      "name": "郭沫若(1892-1978)",
                      "level": "5"
                    },
                    {
                      "name": "毛泽东(1893-1976)",
                      "level": "5"
                    },
                    {
                      "name": "顾颉刚(1893-1980)",
                      "level": "5"
                    },
                    {
                      "name": "许地山(1893-1941)",
                      "level": "5"
                    },
                    {
                      "name": "丁西林(1893-1974)",
                      "level": "5"
                    },
                    {
                      "name": "叶圣陶(1894-1988)",
                      "level": "5"
                    },
                    {
                      "name": "邹韬奋(1895-1944)",
                      "level": "5"
                    },
                    {
                      "name": "冯友兰(1895-1990)",
                      "level": "5"
                    },
                    {
                      "name": "林语堂(1895-1976)",
                      "level": "5"
                    },
                    {
                      "name": "茅盾(1896-1981)",
                      "level": "5"
                    },
                    {
                      "name": "郁达夫(1896-1945)",
                      "level": "5"
                    },
                    {
                      "name": "徐志摩(1896-1945)",
                      "level": "5"
                    },
                    {
                      "name": "朱光潜(1897-1986)",
                      "level": "5"
                    },
                    {
                      "name": "田汉(1898-1968)",
                      "level": "5"
                    },
                    {
                      "name": "朱自清(1898-1948)",
                      "level": "5"
                    },
                    {
                      "name": "郑振铎(1898-1948)",
                      "level": "5"
                    },
                    {
                      "name": "翦伯赞(1898-1968)",
                      "level": "5"
                    },
                    {
                      "name": "瞿秋白(1899-1935)",
                      "level": "5"
                    },
                    {
                      "name": "闻一多(1899-1946)",
                      "level": "5"
                    },
                    {
                      "name": "老舍(1899-1966)",
                      "level": "5"
                    },
                    {
                      "name": "冰心(1900-1999)",
                      "level": "5"
                    },
                    {
                      "name": "夏衍(1900-1995)",
                      "level": "5"
                    },
                    {
                      "name": "王力(1900-1986)",
                      "level": "5"
                    },
                    {
                      "name": "鲁彦(1901-1944)",
                      "level": "5"
                    },
                    {
                      "name": "陈毅(1901-1972)",
                      "level": "5"
                    },
                    {
                      "name": "梁思成(1901-1972)",
                      "level": "5"
                    },
                    {
                      "name": "柔石(1902-1931)",
                      "level": "5"
                    },
                    {
                      "name": "沈从文(1902-1988)",
                      "level": "5"
                    },
                    {
                      "name": "李伟森(1903-1931)",
                      "level": "5"
                    },
                    {
                      "name": "冯雪峰(1903-1976)",
                      "level": "5"
                    },
                    {
                      "name": "胡也频(1903-1931)",
                      "level": "5"
                    },
                    {
                      "name": "梁实秋（1903－1987）",
                      "level": "5"
                    },
                    {
                      "name": "巴金(1904-2005)",
                      "level": "5"
                    },
                    {
                      "name": "艾芜(1904-1992)",
                      "level": "5"
                    },
                    {
                      "name": "沙汀(1904-1992)",
                      "level": "5"
                    },
                    {
                      "name": "丁玲(1904-1986)",
                      "level": "5"
                    },
                    {
                      "name": "吕叔湘(1904-1998)",
                      "level": "5"
                    },
                    {
                      "name": "臧克家(1905-2004)",
                      "level": "5"
                    },
                    {
                      "name": "李广田(1906-1968)",
                      "level": "5"
                    },
                    {
                      "name": "吴伯箫(1906-1982)",
                      "level": "5"
                    },
                    {
                      "name": "赵树理(1906-1970)",
                      "level": "5"
                    },
                    {
                      "name": "张天翼(1906-1985)",
                      "level": "5"
                    },
                    {
                      "name": "李健吾(1906-1982)",
                      "level": "5"
                    },
                    {
                      "name": "冯铿(1907-1931)",
                      "level": "5"
                    },
                    {
                      "name": "萧军(1907-1988)",
                      "level": "5"
                    },
                    {
                      "name": "傅雷（1908－1966）",
                      "level": "5"
                    },
                    {
                      "name": "周立波(1908-1979)",
                      "level": "5"
                    },
                    {
                      "name": "吴晗(1909-1969)",
                      "level": "5"
                    },
                    {
                      "name": "姚雪垠(1910-1999)",
                      "level": "5"
                    },
                    {
                      "name": "曹禺(1910-1996)",
                      "level": "5"
                    },
                    {
                      "name": "艾青(1910-1996)",
                      "level": "5"
                    },
                    {
                      "name": "钱钟书(1910-1998)",
                      "level": "5"
                    },
                    {
                      "name": "萧乾(1910-1999)",
                      "level": "5"
                    },
                    {
                      "name": "吴强(1910-1990)",
                      "level": "5"
                    },
                    {
                      "name": "萧红(1911-1942)",
                      "level": "5"
                    },
                    {
                      "name": "季羡林（1911－2009）",
                      "level": "5"
                    },
                    {
                      "name": "马南邨(1912-1966)",
                      "level": "5"
                    },
                    {
                      "name": "孙犁(1913-2002)",
                      "level": "5"
                    },
                    {
                      "name": "杨朔(1913-1968)",
                      "level": "5"
                    },
                    {
                      "name": "唐弢(1913-1992)",
                      "level": "5"
                    },
                    {
                      "name": "杨沫(1914-1995)",
                      "level": "5"
                    },
                    {
                      "name": "周而复(1914-2004)",
                      "level": "5"
                    },
                    {
                      "name": "徐迟(1914-1996)",
                      "level": "5"
                    },
                    {
                      "name": "叶君健(1914-1999)",
                      "level": "5"
                    },
                    {
                      "name": "严文井(1915-2005)",
                      "level": "5"
                    },
                    {
                      "name": "柳青(1916-1978)",
                      "level": "5"
                    },
                    {
                      "name": "刘白羽(1916-2005)",
                      "level": "5"
                    },
                    {
                      "name": "袁珂(1916-2001)",
                      "level": "5"
                    },
                    {
                      "name": "田间(1916-1985)",
                      "level": "5"
                    },
                    {
                      "name": "碧野(1916-2005)",
                      "level": "5"
                    },
                    {
                      "name": "查良铮(1918-1977)",
                      "level": "5"
                    },
                    {
                      "name": "秦牧(1919-1992)",
                      "level": "5"
                    },
                    {
                      "name": "黄仁宇(1918-2000)",
                      "level": "5"
                    },
                    {
                      "name": "林海音（1918-2001）",
                      "level": "5"
                    },
                    {
                      "name": "郭小川(1919-1976)",
                      "level": "5"
                    },
                    {
                      "name": "魏巍(1920-2008)",
                      "level": "5"
                    },
                    {
                      "name": "汪曾祺(1920-1997)",
                      "level": "5"
                    },
                    {
                      "name": "张爱玲(1920-1995)",
                      "level": "5"
                    },
                    {
                      "name": "杜鹏程(1921-1991)",
                      "level": "5"
                    },
                    {
                      "name": "何为(1922-2011)",
                      "level": "5"
                    },
                    {
                      "name": "峻青(1922-)",
                      "level": "5"
                    },
                    {
                      "name": "李季(1922-1980)",
                      "level": "5"
                    },
                    {
                      "name": "马峰(1922-)",
                      "level": "5"
                    },
                    {
                      "name": "曲波(1923-2002)",
                      "level": "5"
                    },
                    {
                      "name": "贺敬之(1924-)",
                      "level": "5"
                    },
                    {
                      "name": "其他现代作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "当代",
                  "level": "4",
                  "children": [
                    {
                      "name": "金庸(1924-2018)",
                      "level": "5"
                    },
                    {
                      "name": "王鼎钧（1925－）",
                      "level": "5"
                    },
                    {
                      "name": "茹志鹃(1925-1998)",
                      "level": "5"
                    },
                    {
                      "name": "陆文夫(1928-2005)",
                      "level": "5"
                    },
                    {
                      "name": "高晓声(1928-1999)",
                      "level": "5"
                    },
                    {
                      "name": "宗璞(1928-)",
                      "level": "5"
                    },
                    {
                      "name": "李淮(1928-)",
                      "level": "5"
                    },
                    {
                      "name": "余光中（1928-2017）",
                      "level": "5"
                    },
                    {
                      "name": "王愿坚(1929-1991)",
                      "level": "5"
                    },
                    {
                      "name": "李国文（1930－）",
                      "level": "5"
                    },
                    {
                      "name": "邓友梅(1931-)",
                      "level": "5"
                    },
                    {
                      "name": "邵燕祥(1933-)",
                      "level": "5"
                    },
                    {
                      "name": "王蒙(1934-)",
                      "level": "5"
                    },
                    {
                      "name": "刘绍棠(1936-1997)",
                      "level": "5"
                    },
                    {
                      "name": "张贤亮(1936-)",
                      "level": "5"
                    },
                    {
                      "name": "张洁(1937-)",
                      "level": "5"
                    },
                    {
                      "name": "琼瑶(1938-)",
                      "level": "5"
                    },
                    {
                      "name": "蒋子龙(1941-)",
                      "level": "5"
                    },
                    {
                      "name": "张晓风（1941-）",
                      "level": "5"
                    },
                    {
                      "name": "刘心武(1942-)",
                      "level": "5"
                    },
                    {
                      "name": "冯骥才(1942-)",
                      "level": "5"
                    },
                    {
                      "name": "陈忠实(1942-2012)",
                      "level": "5"
                    },
                    {
                      "name": "席慕蓉(1943-)",
                      "level": "5"
                    },
                    {
                      "name": "三毛(1943—1991)",
                      "level": "5"
                    },
                    {
                      "name": "周国平（1945-）",
                      "level": "5"
                    },
                    {
                      "name": "肖复兴（1947- ）",
                      "level": "5"
                    },
                    {
                      "name": "路遥(1949-1992)",
                      "level": "5"
                    },
                    {
                      "name": "梁晓声(1949-)",
                      "level": "5"
                    },
                    {
                      "name": "史铁生(1951-2010)",
                      "level": "5"
                    },
                    {
                      "name": "莫怀戚（1951－2014）",
                      "level": "5"
                    },
                    {
                      "name": "贾平凹(1952-）",
                      "level": "5"
                    },
                    {
                      "name": "毕淑敏（1952-）",
                      "level": "5"
                    },
                    {
                      "name": "赵丽宏（1952－）",
                      "level": "5"
                    },
                    {
                      "name": "林清玄（1953－）",
                      "level": "5"
                    },
                    {
                      "name": "曹文轩（1954－）",
                      "level": "5"
                    },
                    {
                      "name": "莫言(1955-)",
                      "level": "5"
                    },
                    {
                      "name": "余华(1960-）",
                      "level": "5"
                    },
                    {
                      "name": "周海亮（1972－）",
                      "level": "5"
                    },
                    {
                      "name": "丁立梅",
                      "level": "5"
                    },
                    {
                      "name": "包利民",
                      "level": "5"
                    },
                    {
                      "name": "其他当代作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "其他中国现当代作家",
                  "level": "4"
                }
              ]
            },
            {
              "name": "外国文学",
              "level": "3",
              "children": [
                {
                  "name": "爱尔兰",
                  "level": "4",
                  "children": [
                    {
                      "name": "乔伊斯",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "奥地利",
                  "level": "4",
                  "children": [
                    {
                      "name": "卡夫卡",
                      "level": "5"
                    },
                    {
                      "name": "斯蒂芬·茨威格",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "澳大利亚",
                  "level": "4",
                  "children": [
                    {
                      "name": "考琳·麦卡洛",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "波兰",
                  "level": "4",
                  "children": [
                    {
                      "name": "密茨凯维奇",
                      "level": "5"
                    },
                    {
                      "name": "显克微支",
                      "level": "5"
                    },
                    {
                      "name": "约瑟夫·康拉德",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "丹麦",
                  "level": "4",
                  "children": [
                    {
                      "name": "安徒生",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "德国",
                  "level": "4",
                  "children": [
                    {
                      "name": "歌德",
                      "level": "5"
                    },
                    {
                      "name": "席勒",
                      "level": "5"
                    },
                    {
                      "name": "格林兄弟",
                      "level": "5"
                    },
                    {
                      "name": "莱辛",
                      "level": "5"
                    },
                    {
                      "name": "海涅",
                      "level": "5"
                    },
                    {
                      "name": "赫尔曼·黑塞",
                      "level": "5"
                    },
                    {
                      "name": "亨利希·海涅",
                      "level": "5"
                    },
                    {
                      "name": "托马斯·曼",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "俄国",
                  "level": "4",
                  "children": [
                    {
                      "name": "普希金",
                      "level": "5"
                    },
                    {
                      "name": "果戈理",
                      "level": "5"
                    },
                    {
                      "name": "屠格涅夫",
                      "level": "5"
                    },
                    {
                      "name": "陀思妥耶夫斯基",
                      "level": "5"
                    },
                    {
                      "name": "别林斯基",
                      "level": "5"
                    },
                    {
                      "name": "车尔尼雪夫斯基",
                      "level": "5"
                    },
                    {
                      "name": "莱蒙托夫",
                      "level": "5"
                    },
                    {
                      "name": "列夫·托尔斯泰",
                      "level": "5"
                    },
                    {
                      "name": "契诃夫",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "法国",
                  "level": "4",
                  "children": [
                    {
                      "name": "拉伯雷",
                      "level": "5"
                    },
                    {
                      "name": "拉辛",
                      "level": "5"
                    },
                    {
                      "name": "莫里哀",
                      "level": "5"
                    },
                    {
                      "name": "伏尔泰",
                      "level": "5"
                    },
                    {
                      "name": "卢梭",
                      "level": "5"
                    },
                    {
                      "name": "雨果",
                      "level": "5"
                    },
                    {
                      "name": "大仲马",
                      "level": "5"
                    },
                    {
                      "name": "乔治·桑",
                      "level": "5"
                    },
                    {
                      "name": "司汤达",
                      "level": "5"
                    },
                    {
                      "name": "波德莱尔",
                      "level": "5"
                    },
                    {
                      "name": "巴尔扎克",
                      "level": "5"
                    },
                    {
                      "name": "福楼拜",
                      "level": "5"
                    },
                    {
                      "name": "梅里美",
                      "level": "5"
                    },
                    {
                      "name": "西蒙·波娃",
                      "level": "5"
                    },
                    {
                      "name": "鲍狄埃",
                      "level": "5"
                    },
                    {
                      "name": "左拉",
                      "level": "5"
                    },
                    {
                      "name": "莫泊桑",
                      "level": "5"
                    },
                    {
                      "name": "都德",
                      "level": "5"
                    },
                    {
                      "name": "罗曼·罗兰",
                      "level": "5"
                    },
                    {
                      "name": "普罗斯特",
                      "level": "5"
                    },
                    {
                      "name": "萨德",
                      "level": "5"
                    },
                    {
                      "name": "埃克多·马洛",
                      "level": "5"
                    },
                    {
                      "name": "夏多布里昂",
                      "level": "5"
                    },
                    {
                      "name": "杜拉斯",
                      "level": "5"
                    },
                    {
                      "name": "普鲁斯特",
                      "level": "5"
                    },
                    {
                      "name": "弗朗索瓦兹·萨冈",
                      "level": "5"
                    },
                    {
                      "name": "圣·埃克苏佩里",
                      "level": "5"
                    },
                    {
                      "name": "法布尔",
                      "level": "5"
                    },
                    {
                      "name": "让·乔诺",
                      "level": "5"
                    },
                    {
                      "name": "儒勒·凡尔纳",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "哥伦比亚",
                  "level": "4",
                  "children": [
                    {
                      "name": "马尔克斯",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "古罗马",
                  "level": "4",
                  "children": [
                    {
                      "name": "贺拉斯",
                      "level": "5"
                    },
                    {
                      "name": "维吉尔",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "古希腊",
                  "level": "4",
                  "children": [
                    {
                      "name": "柏拉图",
                      "level": "5"
                    },
                    {
                      "name": "亚里士多德",
                      "level": "5"
                    },
                    {
                      "name": "荷马",
                      "level": "5"
                    },
                    {
                      "name": "埃斯库罗斯",
                      "level": "5"
                    },
                    {
                      "name": "索福克勒斯",
                      "level": "5"
                    },
                    {
                      "name": "欧里庇得斯",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "加拿大",
                  "level": "4",
                  "children": [
                    {
                      "name": "露西·蒙格玛丽",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "捷克",
                  "level": "4",
                  "children": [
                    {
                      "name": "米兰·昆德拉",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "美国",
                  "level": "4",
                  "children": [
                    {
                      "name": "华盛顿·欧文",
                      "level": "5"
                    },
                    {
                      "name": "斯托夫人",
                      "level": "5"
                    },
                    {
                      "name": "玛格丽特·米切尔",
                      "level": "5"
                    },
                    {
                      "name": "奥尔科特",
                      "level": "5"
                    },
                    {
                      "name": "惠特曼",
                      "level": "5"
                    },
                    {
                      "name": "马克·吐温",
                      "level": "5"
                    },
                    {
                      "name": "欧·亨利",
                      "level": "5"
                    },
                    {
                      "name": "杰克·伦敦",
                      "level": "5"
                    },
                    {
                      "name": "霍桑",
                      "level": "5"
                    },
                    {
                      "name": "福克纳",
                      "level": "5"
                    },
                    {
                      "name": "德莱赛",
                      "level": "5"
                    },
                    {
                      "name": "约瑟夫·海勒",
                      "level": "5"
                    },
                    {
                      "name": "海明威",
                      "level": "5"
                    },
                    {
                      "name": "詹姆斯·凯恩",
                      "level": "5"
                    },
                    {
                      "name": "丹·布朗",
                      "level": "5"
                    },
                    {
                      "name": "杜鲁门·卡波特",
                      "level": "5"
                    },
                    {
                      "name": "雷蒙德卡佛",
                      "level": "5"
                    },
                    {
                      "name": "亨利·大卫·梭罗",
                      "level": "5"
                    },
                    {
                      "name": "玛·金·罗琳斯",
                      "level": "5"
                    },
                    {
                      "name": "菲茨杰拉德",
                      "level": "5"
                    },
                    {
                      "name": "温斯顿·格卢姆",
                      "level": "5"
                    },
                    {
                      "name": "卡森·麦卡勒斯",
                      "level": "5"
                    },
                    {
                      "name": "赫尔曼·梅尔维尔",
                      "level": "5"
                    },
                    {
                      "name": "亨利·米勒",
                      "level": "5"
                    },
                    {
                      "name": "安妮·普鲁克斯",
                      "level": "5"
                    },
                    {
                      "name": "安妮·赖斯",
                      "level": "5"
                    },
                    {
                      "name": "杰罗姆·大卫·塞林格",
                      "level": "5"
                    },
                    {
                      "name": "艾西莫夫",
                      "level": "5"
                    },
                    {
                      "name": "海伦凯勒",
                      "level": "5"
                    },
                    {
                      "name": "埃德加·斯诺",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "挪威",
                  "level": "4",
                  "children": [
                    {
                      "name": "易卜生",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "日本",
                  "level": "4",
                  "children": [
                    {
                      "name": "川端康成",
                      "level": "5"
                    },
                    {
                      "name": "村上春树",
                      "level": "5"
                    },
                    {
                      "name": "大江健三郎",
                      "level": "5"
                    },
                    {
                      "name": "三岛由纪夫",
                      "level": "5"
                    },
                    {
                      "name": "夏目漱石",
                      "level": "5"
                    },
                    {
                      "name": "渡边淳一",
                      "level": "5"
                    },
                    {
                      "name": "青山七惠",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "苏格兰",
                  "level": "4",
                  "children": [
                    {
                      "name": "伏尼契",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "苏联",
                  "level": "4",
                  "children": [
                    {
                      "name": "高尔基",
                      "level": "5"
                    },
                    {
                      "name": "奥斯特洛夫斯基",
                      "level": "5"
                    },
                    {
                      "name": "肖洛霍夫",
                      "level": "5"
                    },
                    {
                      "name": "帕斯捷尔纳克",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "西班牙",
                  "level": "4",
                  "children": [
                    {
                      "name": "塞万提斯",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "匈牙利",
                  "level": "4",
                  "children": [
                    {
                      "name": "裴多菲",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "意大利",
                  "level": "4",
                  "children": [
                    {
                      "name": "但丁",
                      "level": "5"
                    },
                    {
                      "name": "彼特拉克",
                      "level": "5"
                    },
                    {
                      "name": "薄伽丘",
                      "level": "5"
                    },
                    {
                      "name": "亚米契斯",
                      "level": "5"
                    },
                    {
                      "name": "拉法埃洛·乔万尼奥里",
                      "level": "5"
                    },
                    {
                      "name": "卡尔维诺",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "印度",
                  "level": "4",
                  "children": [
                    {
                      "name": "泰戈尔",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "英国",
                  "level": "4",
                  "children": [
                    {
                      "name": "弗朗西斯·培根",
                      "level": "5"
                    },
                    {
                      "name": "莎士比亚",
                      "level": "5"
                    },
                    {
                      "name": "弥尔顿",
                      "level": "5"
                    },
                    {
                      "name": "亨利·菲尔丁",
                      "level": "5"
                    },
                    {
                      "name": "丹尼尔·笛福",
                      "level": "5"
                    },
                    {
                      "name": "乔纳森·斯威夫特",
                      "level": "5"
                    },
                    {
                      "name": "菲尔丁",
                      "level": "5"
                    },
                    {
                      "name": "奥斯汀",
                      "level": "5"
                    },
                    {
                      "name": "瓦特斯各特",
                      "level": "5"
                    },
                    {
                      "name": "拜伦",
                      "level": "5"
                    },
                    {
                      "name": "雪莱",
                      "level": "5"
                    },
                    {
                      "name": "狄更斯",
                      "level": "5"
                    },
                    {
                      "name": "夏洛蒂·勃朗特",
                      "level": "5"
                    },
                    {
                      "name": "艾米丽·勃朗特",
                      "level": "5"
                    },
                    {
                      "name": "乔治·艾略特",
                      "level": "5"
                    },
                    {
                      "name": "哈代",
                      "level": "5"
                    },
                    {
                      "name": "萨克雷",
                      "level": "5"
                    },
                    {
                      "name": "萧伯纳",
                      "level": "5"
                    },
                    {
                      "name": "劳伦斯",
                      "level": "5"
                    },
                    {
                      "name": "艾略特",
                      "level": "5"
                    },
                    {
                      "name": "济慈",
                      "level": "5"
                    },
                    {
                      "name": "卡罗尔",
                      "level": "5"
                    },
                    {
                      "name": "阿加莎·克里斯蒂",
                      "level": "5"
                    },
                    {
                      "name": "柯南道尔",
                      "level": "5"
                    },
                    {
                      "name": "毛姆",
                      "level": "5"
                    },
                    {
                      "name": "奥斯卡·王尔德",
                      "level": "5"
                    },
                    {
                      "name": "彼得·梅尔",
                      "level": "5"
                    },
                    {
                      "name": "J·K·罗琳",
                      "level": "5"
                    },
                    {
                      "name": "弗吉尼亚·伍尔夫",
                      "level": "5"
                    },
                    {
                      "name": "托尔金",
                      "level": "5"
                    },
                    {
                      "name": "丘吉尔",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "其他外国作家",
                  "level": "4",
                  "children": [
                    {
                      "name": "纪伯伦（1883-1931）",
                      "level": "5",
                      "children": [
                        {
                          "name": "《组歌》",
                          "level": "6"
                        },
                        {
                          "name": "《先知》",
                          "level": "6"
                        },
                        {
                          "name": "《微言》",
                          "level": "6"
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "文学文化常识",
          "level": "2",
          "children": [
            {
              "name": "文学常识综合",
              "level": "3",
              "children": [
                {
                  "name": "史书体例",
                  "level": "4"
                },
                {
                  "name": "作家作品",
                  "level": "4"
                },
                {
                  "name": "文学风格与流派",
                  "level": "4"
                }
              ]
            },
            {
              "name": "文化常识综合",
              "level": "3",
              "children": [
                {
                  "name": "姓名称谓",
                  "level": "4"
                },
                {
                  "name": "古代官职",
                  "level": "4"
                },
                {
                  "name": "天文历法",
                  "level": "4"
                },
                {
                  "name": "古代地理",
                  "level": "4"
                },
                {
                  "name": "科举制度",
                  "level": "4"
                },
                {
                  "name": "风俗礼仪",
                  "level": "4"
                },
                {
                  "name": "饮食器用",
                  "level": "4"
                },
                {
                  "name": "音乐文娱",
                  "level": "4"
                },
                {
                  "name": "文史典籍",
                  "level": "4"
                },
                {
                  "name": "目录辞书",
                  "level": "4"
                },
                {
                  "name": "敬辞谦辞",
                  "level": "4"
                }
              ]
            }
          ]
        },
        {
          "name": "名句名篇默写",
          "level": "2"
        }
      ]
    },
    {
      "name": "阅读与鉴赏",
      "level": "1",
      "children": [
        {
          "name": "诗歌鉴赏",
          "level": "2",
          "children": [
            {
              "name": "诗",
              "level": "3"
            },
            {
              "name": "词",
              "level": "3"
            },
            {
              "name": "曲",
              "level": "3"
            },
            {
              "name": "考点分类",
              "level": "3",
              "children": [
                {
                  "name": "文学基本常识",
                  "level": "4"
                },
                {
                  "name": "词语解释",
                  "level": "4"
                },
                {
                  "name": "意象、画面与意境",
                  "level": "4"
                },
                {
                  "name": "词句赏析",
                  "level": "4"
                },
                {
                  "name": "内容理解",
                  "level": "4"
                },
                {
                  "name": "表现（写作）手法",
                  "level": "4"
                },
                {
                  "name": "情感主旨",
                  "level": "4"
                },
                {
                  "name": "对比阅读",
                  "level": "4"
                },
                {
                  "name": "开放式作答",
                  "level": "4"
                }
              ]
            }
          ]
        },
        {
          "name": "现代诗歌",
          "level": "2",
          "children": [
            {
              "name": "中国诗歌",
              "level": "3"
            },
            {
              "name": "外国诗歌",
              "level": "3"
            }
          ]
        },
        {
          "name": "现代文阅读",
          "level": "2",
          "children": [
            {
              "name": "记叙文",
              "level": "3",
              "children": [
                {
                  "name": "小说",
                  "level": "4"
                },
                {
                  "name": "散文",
                  "level": "4"
                },
                {
                  "name": "人物传记",
                  "level": "4"
                },
                {
                  "name": "通讯",
                  "level": "4"
                },
                {
                  "name": "回忆录",
                  "level": "4"
                },
                {
                  "name": "游记",
                  "level": "4"
                },
                {
                  "name": "新闻",
                  "level": "4"
                },
                {
                  "name": "参观访问记",
                  "level": "4"
                },
                {
                  "name": "民间故事",
                  "level": "4"
                },
                {
                  "name": "寓言",
                  "level": "4"
                },
                {
                  "name": "童话",
                  "level": "4"
                },
                {
                  "name": "戏剧",
                  "level": "4"
                },
                {
                  "name": "其他文体",
                  "level": "4"
                },
                {
                  "name": "考点分类",
                  "level": "4",
                  "children": [
                    {
                      "name": "内容概括，主旨把握",
                      "level": "5"
                    },
                    {
                      "name": "人物形象概括分析",
                      "level": "5"
                    },
                    {
                      "name": "词句理解与赏析",
                      "level": "5"
                    },
                    {
                      "name": "描写方法",
                      "level": "5"
                    },
                    {
                      "name": "表达方式",
                      "level": "5"
                    },
                    {
                      "name": "环境描写",
                      "level": "5"
                    },
                    {
                      "name": "句段作用",
                      "level": "5"
                    },
                    {
                      "name": "记叙顺序",
                      "level": "5"
                    },
                    {
                      "name": "表现手法",
                      "level": "5"
                    },
                    {
                      "name": "人称选用",
                      "level": "5"
                    },
                    {
                      "name": "标题含义",
                      "level": "5"
                    },
                    {
                      "name": "标题作用",
                      "level": "5"
                    },
                    {
                      "name": "行文线索",
                      "level": "5"
                    },
                    {
                      "name": "开放性作答",
                      "level": "5"
                    },
                    {
                      "name": "阅读策略与方法",
                      "level": "5"
                    }
                  ]
                }
              ]
            },
            {
              "name": "说明文",
              "level": "3",
              "children": [
                {
                  "name": "事物说明文",
                  "level": "4"
                },
                {
                  "name": "事理说明文",
                  "level": "4"
                },
                {
                  "name": "说明文类别",
                  "level": "4"
                },
                {
                  "name": "考点分类",
                  "level": "4",
                  "children": [
                    {
                      "name": "说明对象",
                      "level": "5"
                    },
                    {
                      "name": "说明方法",
                      "level": "5"
                    },
                    {
                      "name": "说明顺序",
                      "level": "5"
                    },
                    {
                      "name": "说明文语言",
                      "level": "5"
                    },
                    {
                      "name": "说明文语段作用",
                      "level": "5"
                    },
                    {
                      "name": "说明文标题",
                      "level": "5"
                    },
                    {
                      "name": "说明内容概括",
                      "level": "5"
                    },
                    {
                      "name": "说明材料回归",
                      "level": "5"
                    }
                  ]
                }
              ]
            },
            {
              "name": "议论文",
              "level": "3",
              "children": [
                {
                  "name": "文体分类",
                  "level": "4",
                  "children": [
                    {
                      "name": "立论文",
                      "level": "5"
                    },
                    {
                      "name": "驳论文",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "考点分类",
                  "level": "4",
                  "children": [
                    {
                      "name": "论点提炼",
                      "level": "5"
                    },
                    {
                      "name": "论据作用",
                      "level": "5"
                    },
                    {
                      "name": "论据补充",
                      "level": "5"
                    },
                    {
                      "name": "论据概括",
                      "level": "5"
                    },
                    {
                      "name": "论证方法",
                      "level": "5"
                    },
                    {
                      "name": "论证思路",
                      "level": "5"
                    },
                    {
                      "name": "议论文开头",
                      "level": "5"
                    },
                    {
                      "name": "议论文语言",
                      "level": "5"
                    },
                    {
                      "name": "内容理解与辨析",
                      "level": "5"
                    },
                    {
                      "name": "谈认识、谈看法",
                      "level": "5"
                    }
                  ]
                }
              ]
            },
            {
              "name": "非连续性文本",
              "level": "3",
              "children": [
                {
                  "name": "考点分类",
                  "level": "4",
                  "children": [
                    {
                      "name": "信息的筛选与辨析",
                      "level": "5"
                    },
                    {
                      "name": "材料的提炼与概括",
                      "level": "5"
                    },
                    {
                      "name": "拟写标题",
                      "level": "5"
                    },
                    {
                      "name": "图（表）文转换",
                      "level": "5"
                    },
                    {
                      "name": "建议与启示",
                      "level": "5"
                    },
                    {
                      "name": "拓展与运用",
                      "level": "5"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "文言文阅读",
          "level": "2",
          "children": [
            {
              "name": "文言题材",
              "level": "3",
              "children": [
                {
                  "name": "人物传记类",
                  "level": "4"
                },
                {
                  "name": "历史事件类",
                  "level": "4"
                },
                {
                  "name": "议论说理类",
                  "level": "4"
                },
                {
                  "name": "山水游记类",
                  "level": "4"
                },
                {
                  "name": "日常生活类",
                  "level": "4"
                },
                {
                  "name": "寓言神话类",
                  "level": "4"
                },
                {
                  "name": "读书学习类",
                  "level": "4"
                },
                {
                  "name": "传统美德类",
                  "level": "4"
                },
                {
                  "name": "治国谋略类",
                  "level": "4"
                },
                {
                  "name": "小说类",
                  "level": "4"
                }
              ]
            },
            {
              "name": "文言考点",
              "level": "3",
              "children": [
                {
                  "name": "文学常识",
                  "level": "4"
                },
                {
                  "name": "文言实词",
                  "level": "4"
                },
                {
                  "name": "文言虚词",
                  "level": "4"
                },
                {
                  "name": "通假字",
                  "level": "4"
                },
                {
                  "name": "词类活用",
                  "level": "4"
                },
                {
                  "name": "一词多义",
                  "level": "4"
                },
                {
                  "name": "古今异义",
                  "level": "4"
                },
                {
                  "name": "文言句式",
                  "level": "4"
                },
                {
                  "name": "文言文断句",
                  "level": "4"
                },
                {
                  "name": "文言文翻译",
                  "level": "4"
                },
                {
                  "name": "内容理解与概括",
                  "level": "4"
                },
                {
                  "name": "把握人物形象",
                  "level": "4"
                },
                {
                  "name": "分析写作手法",
                  "level": "4"
                },
                {
                  "name": "主题情感",
                  "level": "4"
                },
                {
                  "name": "开放式回答",
                  "level": "4"
                }
              ]
            }
          ]
        },
        {
          "name": "整本书阅读",
          "level": "2",
          "children": [
            {
              "name": "《朝花夕拾》",
              "level": "3"
            },
            {
              "name": "《西游记》",
              "level": "3"
            },
            {
              "name": "《骆驼祥子》",
              "level": "3"
            },
            {
              "name": "《海底两万里》",
              "level": "3"
            },
            {
              "name": "《红星照耀中国》",
              "level": "3"
            },
            {
              "name": "《昆虫记》",
              "level": "3"
            },
            {
              "name": "《傅雷家书》",
              "level": "3"
            },
            {
              "name": "《钢铁是怎样炼成的》",
              "level": "3"
            },
            {
              "name": "《水浒传》",
              "level": "3"
            },
            {
              "name": "《三国演义》",
              "level": "3"
            },
            {
              "name": "《红楼梦》",
              "level": "3"
            },
            {
              "name": "《儒林外史》",
              "level": "3"
            },
            {
              "name": "《简·爱》",
              "level": "3"
            },
            {
              "name": "《艾青诗选》",
              "level": "3"
            },
            {
              "name": "《经典常谈》",
              "level": "3"
            },
            {
              "name": "《猎人笔记》",
              "level": "3"
            },
            {
              "name": "《红岩》",
              "level": "3"
            },
            {
              "name": "《平凡的世界》",
              "level": "3"
            },
            {
              "name": "《名人传》",
              "level": "3"
            },
            {
              "name": "《聊斋志异》",
              "level": "3"
            },
            {
              "name": "《格列佛游记》",
              "level": "3"
            },
            {
              "name": "《围城》",
              "level": "3"
            },
            {
              "name": "《鲁滨逊漂流记》",
              "level": "3"
            },
            {
              "name": "《伊索寓言》",
              "level": "3"
            },
            {
              "name": "其他名著",
              "level": "3"
            }
          ]
        }
      ]
    },
    {
      "name": "写作",
      "level": "1",
      "children": [
        {
          "name": "全命题作文",
          "level": "2"
        },
        {
          "name": "半命题作文",
          "level": "2"
        },
        {
          "name": "话题作文",
          "level": "2"
        },
        {
          "name": "材料作文",
          "level": "2"
        },
        {
          "name": "情境作文（联想与想象）",
          "level": "2"
        },
        {
          "name": "应用文",
          "level": "2"
        },
        {
          "name": "小作文",
          "level": "2"
        }
      ]
    },
    {
      "name": "作家作品",
      "level": "1",
      "children": [
        {
          "name": "文章作者",
          "level": "2",
          "children": [
            {
              "name": "中国古代文学",
              "level": "3",
              "children": [
                {
                  "name": "春秋",
                  "level": "4",
                  "children": [
                    {
                      "name": "孔子(前551-前479)",
                      "level": "5"
                    },
                    {
                      "name": "左丘明(前556-前451)",
                      "level": "5"
                    },
                    {
                      "name": "墨子(约前468-前376)",
                      "level": "5"
                    },
                    {
                      "name": "老子(约前570-500)",
                      "level": "5"
                    },
                    {
                      "name": "孙子(约前551-前479)",
                      "level": "5"
                    },
                    {
                      "name": "其他春秋作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "战国",
                  "level": "4",
                  "children": [
                    {
                      "name": "孟子(前372-前289)",
                      "level": "5"
                    },
                    {
                      "name": "庄子(约前369-前286)",
                      "level": "5"
                    },
                    {
                      "name": "荀子(前313-前238)",
                      "level": "5"
                    },
                    {
                      "name": "韩非子(前280-前233)",
                      "level": "5"
                    },
                    {
                      "name": "吕不韦(前292-前235)",
                      "level": "5"
                    },
                    {
                      "name": "列子(约前649-前606)",
                      "level": "5"
                    },
                    {
                      "name": "屈原(约前340-约前278)",
                      "level": "5"
                    },
                    {
                      "name": "宋玉(约前298-222)",
                      "level": "5"
                    },
                    {
                      "name": "其他战国作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "西汉",
                  "level": "4",
                  "children": [
                    {
                      "name": "贾谊(前200-前168)",
                      "level": "5"
                    },
                    {
                      "name": "司马迁(前145-前90)",
                      "level": "5"
                    },
                    {
                      "name": "刘向(约前77-前6)",
                      "level": "5"
                    },
                    {
                      "name": "其他西汉作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "东汉",
                  "level": "4",
                  "children": [
                    {
                      "name": "班固(32-92)",
                      "level": "5"
                    },
                    {
                      "name": "其他东汉作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "三国",
                  "level": "4",
                  "children": [
                    {
                      "name": "曹操(155-220)",
                      "level": "5"
                    },
                    {
                      "name": "诸葛亮(181-234)",
                      "level": "5"
                    },
                    {
                      "name": "曹丕(187-226)",
                      "level": "5"
                    },
                    {
                      "name": "曹植(192-232)",
                      "level": "5"
                    },
                    {
                      "name": "阮籍(210-263)",
                      "level": "5"
                    },
                    {
                      "name": "其他三国作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "西晋",
                  "level": "4",
                  "children": [
                    {
                      "name": "李密(233-297)",
                      "level": "5"
                    },
                    {
                      "name": "陈寿(233-297)",
                      "level": "5"
                    },
                    {
                      "name": "陆机(261-303)",
                      "level": "5"
                    },
                    {
                      "name": "王羲之(303-361)",
                      "level": "5"
                    },
                    {
                      "name": "西晋其他作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "东晋",
                  "level": "4",
                  "children": [
                    {
                      "name": "陶渊明(365-427)",
                      "level": "5"
                    },
                    {
                      "name": "干宝(283-351)",
                      "level": "5"
                    },
                    {
                      "name": "谢灵运(385-433)",
                      "level": "5"
                    },
                    {
                      "name": "东晋其他作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "南北朝",
                  "level": "4",
                  "children": [
                    {
                      "name": "范晔(398-445)",
                      "level": "5"
                    },
                    {
                      "name": "刘义庆(403-444)",
                      "level": "5"
                    },
                    {
                      "name": "鲍照(约414-466)",
                      "level": "5"
                    },
                    {
                      "name": "陶弘景（456—536年）",
                      "level": "5"
                    },
                    {
                      "name": "谢朓(464-499)",
                      "level": "5"
                    },
                    {
                      "name": "丘迟(464-508)",
                      "level": "5"
                    },
                    {
                      "name": "刘勰(465-520)",
                      "level": "5"
                    },
                    {
                      "name": "钟嵘(约468-518)",
                      "level": "5"
                    },
                    {
                      "name": "吴均（469～520）",
                      "level": "5"
                    },
                    {
                      "name": "郦道元(470-527)",
                      "level": "5"
                    },
                    {
                      "name": "陈叔宝(553年—604)",
                      "level": "5"
                    },
                    {
                      "name": "其他南北朝作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "隋唐",
                  "level": "4",
                  "children": [
                    {
                      "name": "王勃(650-675)",
                      "level": "5"
                    },
                    {
                      "name": "张若虚(约660-约720)",
                      "level": "5"
                    },
                    {
                      "name": "张九龄(678-740)",
                      "level": "5"
                    },
                    {
                      "name": "杨炯(650-692)",
                      "level": "5"
                    },
                    {
                      "name": "卢照邻(约635-约689)",
                      "level": "5"
                    },
                    {
                      "name": "骆宾王(约640-687)",
                      "level": "5"
                    },
                    {
                      "name": "贺知章(659-744)",
                      "level": "5"
                    },
                    {
                      "name": "王之涣(688-742)",
                      "level": "5"
                    },
                    {
                      "name": "孟浩然(689-740)",
                      "level": "5"
                    },
                    {
                      "name": "王昌龄(690-756)",
                      "level": "5"
                    },
                    {
                      "name": "王湾（693－751）",
                      "level": "5"
                    },
                    {
                      "name": "王维(701-761)",
                      "level": "5"
                    },
                    {
                      "name": "李白(701-762)",
                      "level": "5"
                    },
                    {
                      "name": "高适(700-765)",
                      "level": "5"
                    },
                    {
                      "name": "崔颢(704-754)",
                      "level": "5"
                    },
                    {
                      "name": "常建（708－？）",
                      "level": "5"
                    },
                    {
                      "name": "杜甫(712-770)",
                      "level": "5"
                    },
                    {
                      "name": "岑参(715-770)",
                      "level": "5"
                    },
                    {
                      "name": "张志和(730-810)",
                      "level": "5"
                    },
                    {
                      "name": "韦应物(约737-791)",
                      "level": "5"
                    },
                    {
                      "name": "卢纶（739-799年）",
                      "level": "5"
                    },
                    {
                      "name": "李益(750－830)",
                      "level": "5"
                    },
                    {
                      "name": "孟郊(751-814)",
                      "level": "5"
                    },
                    {
                      "name": "韩愈(768-824)",
                      "level": "5"
                    },
                    {
                      "name": "刘禹锡(772-842)",
                      "level": "5"
                    },
                    {
                      "name": "白居易(772-846)",
                      "level": "5"
                    },
                    {
                      "name": "柳宗元(773-819)",
                      "level": "5"
                    },
                    {
                      "name": "白行简(776-826)",
                      "level": "5"
                    },
                    {
                      "name": "元稹(779-831)",
                      "level": "5"
                    },
                    {
                      "name": "贾岛(779-843)",
                      "level": "5"
                    },
                    {
                      "name": "李贺(790-816)",
                      "level": "5"
                    },
                    {
                      "name": "杜牧(803-853)",
                      "level": "5"
                    },
                    {
                      "name": "温庭筠(约812-866)",
                      "level": "5"
                    },
                    {
                      "name": "李商隐(813-858)",
                      "level": "5"
                    },
                    {
                      "name": "罗隐(833-909)",
                      "level": "5"
                    },
                    {
                      "name": "其他隋唐作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "五代十国",
                  "level": "4",
                  "children": [
                    {
                      "name": "韦庄(约836-910)",
                      "level": "5"
                    },
                    {
                      "name": "冯延巳(903-960)",
                      "level": "5"
                    },
                    {
                      "name": "李煜(937-978)",
                      "level": "5"
                    },
                    {
                      "name": "其他五代十国作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "北宋",
                  "level": "4",
                  "children": [
                    {
                      "name": "柳永(约971-1053)",
                      "level": "5"
                    },
                    {
                      "name": "范仲淹(989-1052)",
                      "level": "5"
                    },
                    {
                      "name": "张先(990-1078)",
                      "level": "5"
                    },
                    {
                      "name": "晏殊(991-1055)",
                      "level": "5"
                    },
                    {
                      "name": "宋祁(998-1061)",
                      "level": "5"
                    },
                    {
                      "name": "欧阳修(1007-1072)",
                      "level": "5"
                    },
                    {
                      "name": "苏洵(1009-1066)",
                      "level": "5"
                    },
                    {
                      "name": "周敦颐(1017-1073)",
                      "level": "5"
                    },
                    {
                      "name": "司马光(1019-1086)",
                      "level": "5"
                    },
                    {
                      "name": "王安石(1021-1086)",
                      "level": "5"
                    },
                    {
                      "name": "沈括(1031-1095)",
                      "level": "5"
                    },
                    {
                      "name": "苏轼(1037-1101)",
                      "level": "5"
                    },
                    {
                      "name": "苏辙(1039-1112)",
                      "level": "5"
                    },
                    {
                      "name": "晏几道(约1040-约1112)",
                      "level": "5"
                    },
                    {
                      "name": "黄庭坚(1045-1105)",
                      "level": "5"
                    },
                    {
                      "name": "秦观(1049-1100)",
                      "level": "5"
                    },
                    {
                      "name": "贺铸(1052-1125)",
                      "level": "5"
                    },
                    {
                      "name": "周邦彦(1056-1121)",
                      "level": "5"
                    },
                    {
                      "name": "其他北宋作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "南宋",
                  "level": "4",
                  "children": [
                    {
                      "name": "李清照(1084-1155)",
                      "level": "5"
                    },
                    {
                      "name": "岳飞(1103-1142)",
                      "level": "5"
                    },
                    {
                      "name": "陆游(1125-1207)",
                      "level": "5"
                    },
                    {
                      "name": "杨万里(1127-1206)",
                      "level": "5"
                    },
                    {
                      "name": "朱熹(1130-1200)",
                      "level": "5"
                    },
                    {
                      "name": "张孝祥(1132-1169)",
                      "level": "5"
                    },
                    {
                      "name": "辛弃疾(1140-1207)",
                      "level": "5"
                    },
                    {
                      "name": "姜夔(1155-1221)",
                      "level": "5"
                    },
                    {
                      "name": "翁卷（生卒年不详）",
                      "level": "5"
                    },
                    {
                      "name": "文天祥(1236-1283)",
                      "level": "5"
                    },
                    {
                      "name": "其他南宋作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "元",
                  "level": "4",
                  "children": [
                    {
                      "name": "关汉卿(1220-1300)",
                      "level": "5"
                    },
                    {
                      "name": "王实甫(不详)",
                      "level": "5"
                    },
                    {
                      "name": "马致远(约1251-1321)",
                      "level": "5"
                    },
                    {
                      "name": "雎景臣(不详)",
                      "level": "5"
                    },
                    {
                      "name": "张养浩(1270-1329)",
                      "level": "5"
                    },
                    {
                      "name": "郑光祖(不详)",
                      "level": "5"
                    },
                    {
                      "name": "张可久(约1270-1348)",
                      "level": "5"
                    },
                    {
                      "name": "乔吉(不详)",
                      "level": "5"
                    },
                    {
                      "name": "施耐庵(不详)",
                      "level": "5"
                    },
                    {
                      "name": "其他元代作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "明",
                  "level": "4",
                  "children": [
                    {
                      "name": "宋濂(1310-1381)",
                      "level": "5"
                    },
                    {
                      "name": "刘基(1311-1375)",
                      "level": "5"
                    },
                    {
                      "name": "罗贯中(不详)",
                      "level": "5"
                    },
                    {
                      "name": "于谦(1398-1457)",
                      "level": "5"
                    },
                    {
                      "name": "吴承恩(1507-1582)",
                      "level": "5"
                    },
                    {
                      "name": "归有光(1506-1571)",
                      "level": "5"
                    },
                    {
                      "name": "汤显祖(1550-1616)",
                      "level": "5"
                    },
                    {
                      "name": "袁宏道(1568-1610)",
                      "level": "5"
                    },
                    {
                      "name": "冯梦龙(1574-1646)",
                      "level": "5"
                    },
                    {
                      "name": "凌濛初(1580-1644)",
                      "level": "5"
                    },
                    {
                      "name": "徐弘祖(1586-1641)",
                      "level": "5"
                    },
                    {
                      "name": "魏学洢(约1596-约1625)",
                      "level": "5"
                    },
                    {
                      "name": "张溥(1602-1641)",
                      "level": "5"
                    },
                    {
                      "name": "其他明代作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "清",
                  "level": "4",
                  "children": [
                    {
                      "name": "张岱(1597-1679)",
                      "level": "5"
                    },
                    {
                      "name": "林嗣环（1607－约1662）",
                      "level": "5"
                    },
                    {
                      "name": "李渔(1610-1680)",
                      "level": "5"
                    },
                    {
                      "name": "顾炎武(1613-1682)",
                      "level": "5"
                    },
                    {
                      "name": "魏禧(1624-1681)",
                      "level": "5"
                    },
                    {
                      "name": "蒲松龄(1640-1715)",
                      "level": "5"
                    },
                    {
                      "name": "洪昇(1645-1704)",
                      "level": "5"
                    },
                    {
                      "name": "孔尚任(1648-1718)",
                      "level": "5"
                    },
                    {
                      "name": "查慎行(1650-1727)",
                      "level": "5"
                    },
                    {
                      "name": "纳兰性德(1655-1685)",
                      "level": "5"
                    },
                    {
                      "name": "方苞(1668-1749)",
                      "level": "5"
                    },
                    {
                      "name": "吴敬梓(1701-1754)",
                      "level": "5"
                    },
                    {
                      "name": "全祖望(1705-1755)",
                      "level": "5"
                    },
                    {
                      "name": "曹雪芹(1715-1764)",
                      "level": "5"
                    },
                    {
                      "name": "袁枚(1716-1798)",
                      "level": "5"
                    },
                    {
                      "name": "纪昀（1724－1805）",
                      "level": "5"
                    },
                    {
                      "name": "姚鼐(1732-1815)",
                      "level": "5"
                    },
                    {
                      "name": "李汝珍（1763-约1830）",
                      "level": "5"
                    },
                    {
                      "name": "龚自珍(1792-1841)",
                      "level": "5"
                    },
                    {
                      "name": "其他清代作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "近代",
                  "level": "4",
                  "children": [
                    {
                      "name": "刘鹗(1857-1909)",
                      "level": "5"
                    },
                    {
                      "name": "康有为(1858-1927)",
                      "level": "5"
                    },
                    {
                      "name": "吴趼人(1866-1910)",
                      "level": "5"
                    },
                    {
                      "name": "孙文(1866-1925)",
                      "level": "5"
                    },
                    {
                      "name": "李宝嘉(1867-1906)",
                      "level": "5"
                    },
                    {
                      "name": "章太炎(1869-1936)",
                      "level": "5"
                    },
                    {
                      "name": "曾朴(1872-1935)",
                      "level": "5"
                    },
                    {
                      "name": "梁启超(1873-1929)",
                      "level": "5"
                    },
                    {
                      "name": "王国维(1877-1927)",
                      "level": "5"
                    },
                    {
                      "name": "其他近代作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "其他古代作家",
                  "level": "4"
                }
              ]
            },
            {
              "name": "中国现当代文学",
              "level": "3",
              "children": [
                {
                  "name": "现代",
                  "level": "4",
                  "children": [
                    {
                      "name": "鲁迅(1881-1936)",
                      "level": "5"
                    },
                    {
                      "name": "周作人(1884-1967)",
                      "level": "5"
                    },
                    {
                      "name": "柳亚子(1887-1958)",
                      "level": "5"
                    },
                    {
                      "name": "胡适(1887-1962)",
                      "level": "5"
                    },
                    {
                      "name": "刘半农(1891-1934)",
                      "level": "5"
                    },
                    {
                      "name": "郭沫若(1892-1978)",
                      "level": "5"
                    },
                    {
                      "name": "毛泽东(1893-1976)",
                      "level": "5"
                    },
                    {
                      "name": "顾颉刚(1893-1980)",
                      "level": "5"
                    },
                    {
                      "name": "许地山(1893-1941)",
                      "level": "5"
                    },
                    {
                      "name": "丁西林(1893-1974)",
                      "level": "5"
                    },
                    {
                      "name": "叶圣陶(1894-1988)",
                      "level": "5"
                    },
                    {
                      "name": "邹韬奋(1895-1944)",
                      "level": "5"
                    },
                    {
                      "name": "冯友兰(1895-1990)",
                      "level": "5"
                    },
                    {
                      "name": "林语堂(1895-1976)",
                      "level": "5"
                    },
                    {
                      "name": "茅盾(1896-1981)",
                      "level": "5"
                    },
                    {
                      "name": "郁达夫(1896-1945)",
                      "level": "5"
                    },
                    {
                      "name": "徐志摩(1896-1945)",
                      "level": "5"
                    },
                    {
                      "name": "朱光潜(1897-1986)",
                      "level": "5"
                    },
                    {
                      "name": "田汉(1898-1968)",
                      "level": "5"
                    },
                    {
                      "name": "朱自清(1898-1948)",
                      "level": "5"
                    },
                    {
                      "name": "郑振铎(1898-1948)",
                      "level": "5"
                    },
                    {
                      "name": "翦伯赞(1898-1968)",
                      "level": "5"
                    },
                    {
                      "name": "瞿秋白(1899-1935)",
                      "level": "5"
                    },
                    {
                      "name": "闻一多(1899-1946)",
                      "level": "5"
                    },
                    {
                      "name": "老舍(1899-1966)",
                      "level": "5"
                    },
                    {
                      "name": "冰心(1900-1999)",
                      "level": "5"
                    },
                    {
                      "name": "夏衍(1900-1995)",
                      "level": "5"
                    },
                    {
                      "name": "王力(1900-1986)",
                      "level": "5"
                    },
                    {
                      "name": "鲁彦(1901-1944)",
                      "level": "5"
                    },
                    {
                      "name": "陈毅(1901-1972)",
                      "level": "5"
                    },
                    {
                      "name": "梁思成(1901-1972)",
                      "level": "5"
                    },
                    {
                      "name": "柔石(1902-1931)",
                      "level": "5"
                    },
                    {
                      "name": "沈从文(1902-1988)",
                      "level": "5"
                    },
                    {
                      "name": "李伟森(1903-1931)",
                      "level": "5"
                    },
                    {
                      "name": "冯雪峰(1903-1976)",
                      "level": "5"
                    },
                    {
                      "name": "胡也频(1903-1931)",
                      "level": "5"
                    },
                    {
                      "name": "梁实秋（1903-1987）",
                      "level": "5"
                    },
                    {
                      "name": "巴金(1904-2005)",
                      "level": "5"
                    },
                    {
                      "name": "艾芜(1904-1992)",
                      "level": "5"
                    },
                    {
                      "name": "沙汀(1904-1992)",
                      "level": "5"
                    },
                    {
                      "name": "丁玲(1904-1986)",
                      "level": "5"
                    },
                    {
                      "name": "吕叔湘(1904-1998)",
                      "level": "5"
                    },
                    {
                      "name": "臧克家(1905-2004)",
                      "level": "5"
                    },
                    {
                      "name": "李广田(1906-1968)",
                      "level": "5"
                    },
                    {
                      "name": "吴伯箫(1906-1982)",
                      "level": "5"
                    },
                    {
                      "name": "赵树理(1906-1970)",
                      "level": "5"
                    },
                    {
                      "name": "张天翼(1906-1985)",
                      "level": "5"
                    },
                    {
                      "name": "李健吾(1906-1982)",
                      "level": "5"
                    },
                    {
                      "name": "冯铿(1907-1931)",
                      "level": "5"
                    },
                    {
                      "name": "萧军(1907-1988)",
                      "level": "5"
                    },
                    {
                      "name": "傅雷（1908－1966）",
                      "level": "5"
                    },
                    {
                      "name": "周立波(1908-1979)",
                      "level": "5"
                    },
                    {
                      "name": "吴组缃(1908-1994)",
                      "level": "5"
                    },
                    {
                      "name": "殷夫(1909-1931)",
                      "level": "5"
                    },
                    {
                      "name": "吴晗(1909-1969)",
                      "level": "5"
                    },
                    {
                      "name": "姚雪垠(1910-1999)",
                      "level": "5"
                    },
                    {
                      "name": "曹禺(1910-1996)",
                      "level": "5"
                    },
                    {
                      "name": "艾青(1910-1996)",
                      "level": "5"
                    },
                    {
                      "name": "钱钟书(1910-1998)",
                      "level": "5"
                    },
                    {
                      "name": "萧乾(1910-1999)",
                      "level": "5"
                    },
                    {
                      "name": "吴强(1910-1990)",
                      "level": "5"
                    },
                    {
                      "name": "萧红(1911-1942)",
                      "level": "5"
                    },
                    {
                      "name": "季羡林（1911－2009）",
                      "level": "5"
                    },
                    {
                      "name": "马南邨(1912-1966)",
                      "level": "5"
                    },
                    {
                      "name": "孙犁(1913-2002)",
                      "level": "5"
                    },
                    {
                      "name": "杨朔(1913-1968)",
                      "level": "5"
                    },
                    {
                      "name": "唐弢(1913-1992)",
                      "level": "5"
                    },
                    {
                      "name": "杨沫(1914-1995)",
                      "level": "5"
                    },
                    {
                      "name": "周而复(1914-2004)",
                      "level": "5"
                    },
                    {
                      "name": "徐迟(1914-1996)",
                      "level": "5"
                    },
                    {
                      "name": "叶君健(1914-1999)",
                      "level": "5"
                    },
                    {
                      "name": "严文井(1915-2005)",
                      "level": "5"
                    },
                    {
                      "name": "柳青(1916-1978)",
                      "level": "5"
                    },
                    {
                      "name": "刘白羽(1916-2005)",
                      "level": "5"
                    },
                    {
                      "name": "袁珂(1916-2001)",
                      "level": "5"
                    },
                    {
                      "name": "田间(1916-1985)",
                      "level": "5"
                    },
                    {
                      "name": "碧野(1916-2005)",
                      "level": "5"
                    },
                    {
                      "name": "查良铮(1918-1977)",
                      "level": "5"
                    },
                    {
                      "name": "秦牧(1919-1992)",
                      "level": "5"
                    },
                    {
                      "name": "黄仁宇(1918-2000)",
                      "level": "5"
                    },
                    {
                      "name": "林海音（1918-2001）",
                      "level": "5"
                    },
                    {
                      "name": "郭小川(1919-1976)",
                      "level": "5"
                    },
                    {
                      "name": "魏巍(1920-2008)",
                      "level": "5"
                    },
                    {
                      "name": "汪曾祺(1920-1997)",
                      "level": "5"
                    },
                    {
                      "name": "张爱玲(1920-1995)",
                      "level": "5"
                    },
                    {
                      "name": "杜鹏程(1921-1991)",
                      "level": "5"
                    },
                    {
                      "name": "何为(1922-2011)",
                      "level": "5"
                    },
                    {
                      "name": "峻青(1922-)",
                      "level": "5"
                    },
                    {
                      "name": "李季(1922-1980)",
                      "level": "5"
                    },
                    {
                      "name": "马峰(1922-)",
                      "level": "5"
                    },
                    {
                      "name": "曲波(1923-2002)",
                      "level": "5"
                    },
                    {
                      "name": "贺敬之(1924-)",
                      "level": "5"
                    },
                    {
                      "name": "其他现代作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "当代",
                  "level": "4",
                  "children": [
                    {
                      "name": "金庸(1924-2018)",
                      "level": "5"
                    },
                    {
                      "name": "王鼎钧（1925－）",
                      "level": "5"
                    },
                    {
                      "name": "茹志鹃(1925-1998)",
                      "level": "5"
                    },
                    {
                      "name": "陆文夫(1928-2005)",
                      "level": "5"
                    },
                    {
                      "name": "高晓声(1928-1999)",
                      "level": "5"
                    },
                    {
                      "name": "宗璞(1928-)",
                      "level": "5"
                    },
                    {
                      "name": "李淮(1928-)",
                      "level": "5"
                    },
                    {
                      "name": "余光中（1928-2017）",
                      "level": "5"
                    },
                    {
                      "name": "王愿坚(1929-1991)",
                      "level": "5"
                    },
                    {
                      "name": "李国文（1930－）",
                      "level": "5"
                    },
                    {
                      "name": "邓友梅(1931-)",
                      "level": "5"
                    },
                    {
                      "name": "邵燕祥(1933-)",
                      "level": "5"
                    },
                    {
                      "name": "王蒙(1934-)",
                      "level": "5"
                    },
                    {
                      "name": "刘绍棠(1936-1997)",
                      "level": "5"
                    },
                    {
                      "name": "张贤亮(1936-)",
                      "level": "5"
                    },
                    {
                      "name": "张洁(1937-)",
                      "level": "5"
                    },
                    {
                      "name": "琼瑶(1938-)",
                      "level": "5"
                    },
                    {
                      "name": "蒋子龙(1941-)",
                      "level": "5"
                    },
                    {
                      "name": "张晓风（1941-）",
                      "level": "5"
                    },
                    {
                      "name": "刘心武(1942-)",
                      "level": "5"
                    },
                    {
                      "name": "冯骥才(1942-)",
                      "level": "5"
                    },
                    {
                      "name": "陈忠实(1942-2012)",
                      "level": "5"
                    },
                    {
                      "name": "席慕蓉(1943-)",
                      "level": "5"
                    },
                    {
                      "name": "三毛(1943—1991)",
                      "level": "5"
                    },
                    {
                      "name": "周国平（1945-）",
                      "level": "5"
                    },
                    {
                      "name": "肖复兴（1947-）",
                      "level": "5"
                    },
                    {
                      "name": "路遥(1949-1992)",
                      "level": "5"
                    },
                    {
                      "name": "梁晓声(1949-)",
                      "level": "5"
                    },
                    {
                      "name": "史铁生(1951-2010)",
                      "level": "5"
                    },
                    {
                      "name": "莫怀戚（1951－2014）",
                      "level": "5"
                    },
                    {
                      "name": "贾平凹(1952-)",
                      "level": "5"
                    },
                    {
                      "name": "毕淑敏（1952-）",
                      "level": "5"
                    },
                    {
                      "name": "赵丽宏（1952－）",
                      "level": "5"
                    },
                    {
                      "name": "林清玄（1953－）",
                      "level": "5"
                    },
                    {
                      "name": "曹文轩（1954－）",
                      "level": "5"
                    },
                    {
                      "name": "莫言(1955-)",
                      "level": "5"
                    },
                    {
                      "name": "余华(1960-）",
                      "level": "5"
                    },
                    {
                      "name": "周海亮（1972－）",
                      "level": "5"
                    },
                    {
                      "name": "丁立梅",
                      "level": "5"
                    },
                    {
                      "name": "包利民",
                      "level": "5"
                    },
                    {
                      "name": "其他当代作家",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "其他中国现当代作家",
                  "level": "4"
                }
              ]
            },
            {
              "name": "外国文学",
              "level": "3",
              "children": [
                {
                  "name": "爱尔兰",
                  "level": "4",
                  "children": [
                    {
                      "name": "乔伊斯",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "奥地利",
                  "level": "4",
                  "children": [
                    {
                      "name": "卡夫卡",
                      "level": "5"
                    },
                    {
                      "name": "斯蒂芬·茨威格",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "澳大利亚",
                  "level": "4",
                  "children": [
                    {
                      "name": "考琳·麦卡洛",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "波兰",
                  "level": "4",
                  "children": [
                    {
                      "name": "密茨凯维奇",
                      "level": "5"
                    },
                    {
                      "name": "显克微支",
                      "level": "5"
                    },
                    {
                      "name": "约瑟夫·康拉德",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "丹麦",
                  "level": "4",
                  "children": [
                    {
                      "name": "安徒生",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "德国",
                  "level": "4",
                  "children": [
                    {
                      "name": "歌德",
                      "level": "5"
                    },
                    {
                      "name": "席勒",
                      "level": "5"
                    },
                    {
                      "name": "格林兄弟",
                      "level": "5"
                    },
                    {
                      "name": "莱辛",
                      "level": "5"
                    },
                    {
                      "name": "海涅",
                      "level": "5"
                    },
                    {
                      "name": "赫尔曼·黑塞",
                      "level": "5"
                    },
                    {
                      "name": "亨利希·海涅",
                      "level": "5"
                    },
                    {
                      "name": "托马斯·曼",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "俄国",
                  "level": "4",
                  "children": [
                    {
                      "name": "普希金",
                      "level": "5"
                    },
                    {
                      "name": "果戈理",
                      "level": "5"
                    },
                    {
                      "name": "屠格涅夫",
                      "level": "5"
                    },
                    {
                      "name": "陀思妥耶夫斯基",
                      "level": "5"
                    },
                    {
                      "name": "别林斯基",
                      "level": "5"
                    },
                    {
                      "name": "车尔尼雪夫斯基",
                      "level": "5"
                    },
                    {
                      "name": "莱蒙托夫",
                      "level": "5"
                    },
                    {
                      "name": "列夫·托尔斯泰",
                      "level": "5"
                    },
                    {
                      "name": "契诃夫",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "法国",
                  "level": "4",
                  "children": [
                    {
                      "name": "拉伯雷",
                      "level": "5"
                    },
                    {
                      "name": "拉辛",
                      "level": "5"
                    },
                    {
                      "name": "莫里哀",
                      "level": "5"
                    },
                    {
                      "name": "伏尔泰",
                      "level": "5"
                    },
                    {
                      "name": "卢梭",
                      "level": "5"
                    },
                    {
                      "name": "雨果",
                      "level": "5"
                    },
                    {
                      "name": "大仲马",
                      "level": "5"
                    },
                    {
                      "name": "乔治·桑",
                      "level": "5"
                    },
                    {
                      "name": "司汤达",
                      "level": "5"
                    },
                    {
                      "name": "波德莱尔",
                      "level": "5"
                    },
                    {
                      "name": "巴尔扎克",
                      "level": "5"
                    },
                    {
                      "name": "福楼拜",
                      "level": "5"
                    },
                    {
                      "name": "梅里美",
                      "level": "5"
                    },
                    {
                      "name": "西蒙·波娃",
                      "level": "5"
                    },
                    {
                      "name": "鲍狄埃",
                      "level": "5"
                    },
                    {
                      "name": "左拉",
                      "level": "5"
                    },
                    {
                      "name": "莫泊桑",
                      "level": "5"
                    },
                    {
                      "name": "都德",
                      "level": "5"
                    },
                    {
                      "name": "罗曼·罗兰",
                      "level": "5"
                    },
                    {
                      "name": "普罗斯特",
                      "level": "5"
                    },
                    {
                      "name": "萨德",
                      "level": "5"
                    },
                    {
                      "name": "埃克多·马洛",
                      "level": "5"
                    },
                    {
                      "name": "夏多布里昂",
                      "level": "5"
                    },
                    {
                      "name": "杜拉斯",
                      "level": "5"
                    },
                    {
                      "name": "普鲁斯特",
                      "level": "5"
                    },
                    {
                      "name": "弗朗索瓦兹·萨冈",
                      "level": "5"
                    },
                    {
                      "name": "圣·埃克苏佩里",
                      "level": "5"
                    },
                    {
                      "name": "法布尔",
                      "level": "5"
                    },
                    {
                      "name": "让·乔诺",
                      "level": "5"
                    },
                    {
                      "name": "儒勒·凡尔纳",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "哥伦比亚",
                  "level": "4",
                  "children": [
                    {
                      "name": "马尔克斯",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "古罗马",
                  "level": "4",
                  "children": [
                    {
                      "name": "贺拉斯",
                      "level": "5"
                    },
                    {
                      "name": "维吉尔",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "古希腊",
                  "level": "4",
                  "children": [
                    {
                      "name": "柏拉图",
                      "level": "5"
                    },
                    {
                      "name": "亚里士多德",
                      "level": "5"
                    },
                    {
                      "name": "荷马",
                      "level": "5"
                    },
                    {
                      "name": "埃斯库罗斯",
                      "level": "5"
                    },
                    {
                      "name": "索福克勒斯",
                      "level": "5"
                    },
                    {
                      "name": "欧里庇得斯",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "加拿大",
                  "level": "4",
                  "children": [
                    {
                      "name": "露西·蒙格玛丽",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "捷克",
                  "level": "4",
                  "children": [
                    {
                      "name": "米兰·昆德拉",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "美国",
                  "level": "4",
                  "children": [
                    {
                      "name": "华盛顿·欧文",
                      "level": "5"
                    },
                    {
                      "name": "斯托夫人",
                      "level": "5"
                    },
                    {
                      "name": "玛格丽特·米切尔",
                      "level": "5"
                    },
                    {
                      "name": "奥尔科特",
                      "level": "5"
                    },
                    {
                      "name": "惠特曼",
                      "level": "5"
                    },
                    {
                      "name": "马克·吐温",
                      "level": "5"
                    },
                    {
                      "name": "欧·亨利",
                      "level": "5"
                    },
                    {
                      "name": "杰克·伦敦",
                      "level": "5"
                    },
                    {
                      "name": "霍桑",
                      "level": "5"
                    },
                    {
                      "name": "福克纳",
                      "level": "5"
                    },
                    {
                      "name": "德莱赛",
                      "level": "5"
                    },
                    {
                      "name": "约瑟夫·海勒",
                      "level": "5"
                    },
                    {
                      "name": "海明威",
                      "level": "5"
                    },
                    {
                      "name": "詹姆斯·凯恩",
                      "level": "5"
                    },
                    {
                      "name": "丹·布朗",
                      "level": "5"
                    },
                    {
                      "name": "杜鲁门·卡波特",
                      "level": "5"
                    },
                    {
                      "name": "雷蒙德卡佛",
                      "level": "5"
                    },
                    {
                      "name": "亨利·大卫·梭罗",
                      "level": "5"
                    },
                    {
                      "name": "玛·金·罗琳斯",
                      "level": "5"
                    },
                    {
                      "name": "菲茨杰拉德",
                      "level": "5"
                    },
                    {
                      "name": "温斯顿·格卢姆",
                      "level": "5"
                    },
                    {
                      "name": "卡森·麦卡勒斯",
                      "level": "5"
                    },
                    {
                      "name": "赫尔曼·梅尔维尔",
                      "level": "5"
                    },
                    {
                      "name": "亨利·米勒",
                      "level": "5"
                    },
                    {
                      "name": "安妮·普鲁克斯",
                      "level": "5"
                    },
                    {
                      "name": "安妮·赖斯",
                      "level": "5"
                    },
                    {
                      "name": "杰罗姆·大卫·塞林格",
                      "level": "5"
                    },
                    {
                      "name": "艾西莫夫",
                      "level": "5"
                    },
                    {
                      "name": "海伦凯勒",
                      "level": "5"
                    },
                    {
                      "name": "埃德加·斯诺",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "挪威",
                  "level": "4",
                  "children": [
                    {
                      "name": "易卜生",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "日本",
                  "level": "4",
                  "children": [
                    {
                      "name": "川端康成",
                      "level": "5"
                    },
                    {
                      "name": "村上春树",
                      "level": "5"
                    },
                    {
                      "name": "大江健三郎",
                      "level": "5"
                    },
                    {
                      "name": "三岛由纪夫",
                      "level": "5"
                    },
                    {
                      "name": "夏目漱石",
                      "level": "5"
                    },
                    {
                      "name": "渡边淳一",
                      "level": "5"
                    },
                    {
                      "name": "青山七惠",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "苏格兰",
                  "level": "4",
                  "children": [
                    {
                      "name": "伏尼契",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "苏联",
                  "level": "4",
                  "children": [
                    {
                      "name": "高尔基",
                      "level": "5"
                    },
                    {
                      "name": "奥斯特洛夫斯基",
                      "level": "5"
                    },
                    {
                      "name": "肖洛霍夫",
                      "level": "5"
                    },
                    {
                      "name": "帕斯捷尔纳克",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "西班牙",
                  "level": "4",
                  "children": [
                    {
                      "name": "塞万提斯",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "匈牙利",
                  "level": "4",
                  "children": [
                    {
                      "name": "裴多菲",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "意大利",
                  "level": "4",
                  "children": [
                    {
                      "name": "但丁",
                      "level": "5"
                    },
                    {
                      "name": "彼特拉克",
                      "level": "5"
                    },
                    {
                      "name": "薄伽丘",
                      "level": "5"
                    },
                    {
                      "name": "亚米契斯",
                      "level": "5"
                    },
                    {
                      "name": "拉法埃洛·乔万尼奥里",
                      "level": "5"
                    },
                    {
                      "name": "卡尔维诺",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "印度",
                  "level": "4",
                  "children": [
                    {
                      "name": "泰戈尔",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "英国",
                  "level": "4",
                  "children": [
                    {
                      "name": "弗朗西斯·培根",
                      "level": "5"
                    },
                    {
                      "name": "莎士比亚",
                      "level": "5"
                    },
                    {
                      "name": "弥尔顿",
                      "level": "5"
                    },
                    {
                      "name": "亨利·菲尔丁",
                      "level": "5"
                    },
                    {
                      "name": "丹尼尔·笛福",
                      "level": "5"
                    },
                    {
                      "name": "乔纳森·斯威夫特",
                      "level": "5"
                    },
                    {
                      "name": "菲尔丁",
                      "level": "5"
                    },
                    {
                      "name": "奥斯汀",
                      "level": "5"
                    },
                    {
                      "name": "瓦特斯各特",
                      "level": "5"
                    },
                    {
                      "name": "拜伦",
                      "level": "5"
                    },
                    {
                      "name": "雪莱",
                      "level": "5"
                    },
                    {
                      "name": "狄更斯",
                      "level": "5"
                    },
                    {
                      "name": "夏洛蒂·勃朗特",
                      "level": "5"
                    },
                    {
                      "name": "艾米丽·勃朗特",
                      "level": "5"
                    },
                    {
                      "name": "乔治·艾略特",
                      "level": "5"
                    },
                    {
                      "name": "哈代",
                      "level": "5"
                    },
                    {
                      "name": "萨克雷",
                      "level": "5"
                    },
                    {
                      "name": "萧伯纳",
                      "level": "5"
                    },
                    {
                      "name": "劳伦斯",
                      "level": "5"
                    },
                    {
                      "name": "艾略特",
                      "level": "5"
                    },
                    {
                      "name": "济慈",
                      "level": "5"
                    },
                    {
                      "name": "卡罗尔",
                      "level": "5"
                    },
                    {
                      "name": "阿加莎·克里斯蒂",
                      "level": "5"
                    },
                    {
                      "name": "柯南道尔",
                      "level": "5"
                    },
                    {
                      "name": "毛姆",
                      "level": "5"
                    },
                    {
                      "name": "奥斯卡·王尔德",
                      "level": "5"
                    },
                    {
                      "name": "彼得·梅尔",
                      "level": "5"
                    },
                    {
                      "name": "J·K·罗琳",
                      "level": "5"
                    },
                    {
                      "name": "弗吉尼亚·伍尔夫",
                      "level": "5"
                    },
                    {
                      "name": "托尔金",
                      "level": "5"
                    },
                    {
                      "name": "丘吉尔",
                      "level": "5"
                    }
                  ]
                },
                {
                  "name": "其他外国作家",
                  "level": "4",
                  "children": [
                    {
                      "name": "纪伯伦（1883-1931）",
                      "level": "5",
                      "children": [
                        {
                          "name": "《组歌》",
                          "level": "6"
                        },
                        {
                          "name": "《先知》",
                          "level": "6"
                        },
                        {
                          "name": "《微言》",
                          "level": "6"
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ];
  
export default chinese_knowlege_dir;