export interface PrimaryVideoSample {
  pack: string;
  subject: string;
  unit: string;
  section: string;
  tag: string;
  title: string;
}

export const PRIMARY_VIDEO_SAMPLES: PrimaryVideoSample[] = [
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "1 草原",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文1草原_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "1 草原",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文1草原_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "1 草原",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文1草原_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "1 草原",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文1草原_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "1 草原",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文1草原_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "2 丁香结",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文2丁香结_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "2 丁香结",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文2丁香结_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "2 丁香结",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文2丁香结_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "2 丁香结",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文2丁香结_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "2 丁香结",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文2丁香结_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文3古诗词三首_宿建德江_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文3古诗词三首_宿建德江_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文3古诗词三首_宿建德江_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文3古诗词三首_宿建德江_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文3古诗词三首_宿建德江_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文3古诗词三首_六月二十七日望湖楼醉书_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文3古诗词三首_六月二十七日望湖楼醉书_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文3古诗词三首_六月二十七日望湖楼醉书_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文3古诗词三首_六月二十七日望湖楼醉书_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文3古诗词三首_六月二十七日望湖楼醉书_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文3古诗词三首_西江月·夜行黄沙道中_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文3古诗词三首_西江月·夜行黄沙道中_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文3古诗词三首_西江月·夜行黄沙道中_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文3古诗词三首_西江月·夜行黄沙道中_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第一单元",
    "section": "3 古诗词三首",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文3古诗词三首_西江月·夜行黄沙道中_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "4 七律·长征",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文4七律·长征_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "4 七律·长征",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文4七律·长征_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "4 七律·长征",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文4七律·长征_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "4 七律·长征",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文4七律·长征_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "4 七律·长征",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文4七律·长征_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "5 狼牙山五壮士",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文5狼牙山五壮士_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "5 狼牙山五壮士",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文5狼牙山五壮士_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "5 狼牙山五壮士",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文5狼牙山五壮士_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "5 狼牙山五壮士",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文5狼牙山五壮士_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "5 狼牙山五壮士",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文5狼牙山五壮士_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "6 开国大典",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文6开国大典_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "6 开国大典",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文6开国大典_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "6 开国大典",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文6开国大典_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "6 开国大典",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文6开国大典_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "6 开国大典",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文6开国大典_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "7 我的战友邱少云",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文7我的战友邱少云_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "7 我的战友邱少云",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文7我的战友邱少云_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "7 我的战友邱少云",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文7我的战友邱少云_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "7 我的战友邱少云",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文7我的战友邱少云_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第二单元",
    "section": "7 我的战友邱少云",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文7我的战友邱少云_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "8 竹节人",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文8竹节人_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "8 竹节人",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文8竹节人_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "8 竹节人",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文8竹节人_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "8 竹节人",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文8竹节人_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "8 竹节人",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文8竹节人_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "9 宇宙生命之谜",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文9宇宙生命之谜_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "9 宇宙生命之谜",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文9宇宙生命之谜_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "9 宇宙生命之谜",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文9宇宙生命之谜_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "9 宇宙生命之谜",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文9宇宙生命之谜_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "9 宇宙生命之谜",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文9宇宙生命之谜_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "10 故宫博物院",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文10故宫博物院_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "10 故宫博物院",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文10故宫博物院_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "10 故宫博物院",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文10故宫博物院_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "10 故宫博物院",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文10故宫博物院_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第三单元",
    "section": "10 故宫博物院",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文10故宫博物院_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "11 桥",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文11桥_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "11 桥",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文11桥_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "11 桥",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文11桥_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "11 桥",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文11桥_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "11 桥",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文11桥_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "12 穷人",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文12穷人_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "12 穷人",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文12穷人_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "12 穷人",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文12穷人_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "12 穷人",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文12穷人_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "12 穷人",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文12穷人_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "13 金色的鱼钩",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文13金色的鱼钩_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "13 金色的鱼钩",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文13金色的鱼钩_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "13 金色的鱼钩",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文13金色的鱼钩_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "13 金色的鱼钩",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文13金色的鱼钩_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第四单元",
    "section": "13 金色的鱼钩",
    "tag": "新课标新考法",
    "title": "人教小学语文6上_课文13金色的鱼钩_新课标新考法"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第五单元",
    "section": "14 灯光",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文14灯光_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第五单元",
    "section": "14 灯光",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文14灯光_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第五单元",
    "section": "14 灯光",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文14灯光_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第五单元",
    "section": "14 灯光",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文14灯光_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第五单元",
    "section": "15 盼",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文15盼_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第五单元",
    "section": "15 盼",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文15盼_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第五单元",
    "section": "15 盼",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文15盼_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第五单元",
    "section": "15 盼",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文15盼_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "16 只有一个地球",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文16只有一个地球_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "16 只有一个地球",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文16只有一个地球_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "16 只有一个地球",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文16只有一个地球_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "16 只有一个地球",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文16只有一个地球_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "17 青山不老",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文17青山不老_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "17 青山不老",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文17青山不老_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "17 青山不老",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文17青山不老_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "17 青山不老",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文17青山不老_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "18 三黑和土地",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文18三黑和土地_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "18 三黑和土地",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文18三黑和土地_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "18 三黑和土地",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文18三黑和土地_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "18 三黑和土地",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文18三黑和土地_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "19 古诗三首",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文19古诗三首_浪淘沙(其一)_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "19 古诗三首",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文19古诗三首_浪淘沙(其一)_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "19 古诗三首",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文19古诗三首_浪淘沙(其一)_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "19 古诗三首",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文19古诗三首_浪淘沙(其一)_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "19 古诗三首",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文19古诗三首_江南春_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "19 古诗三首",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文19古诗三首_江南春_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "19 古诗三首",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文19古诗三首_江南春_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "19 古诗三首",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文19古诗三首_江南春_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "19 古诗三首",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文19古诗三首_书湖阴先生壁_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "19 古诗三首",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文19古诗三首_书湖阴先生壁_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "19 古诗三首",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文19古诗三首_书湖阴先生壁_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第六单元",
    "section": "19 古诗三首",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文19古诗三首_书湖阴先生壁_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "20 文言文二则",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文20文言文二则_两小儿辩日_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "20 文言文二则",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文20文言文二则_两小儿辩日_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "20 文言文二则",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文20文言文二则_两小儿辩日_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "20 文言文二则",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文20文言文二则_两小儿辩日_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "20 文言文二则",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文20文言文二则_曹冲称象_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "20 文言文二则",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文20文言文二则_曹冲称象_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "20 文言文二则",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文20文言文二则_曹冲称象_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "20 文言文二则",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文20文言文二则_曹冲称象_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "21 表里的生物",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文21表里的生物_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "21 表里的生物",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文21表里的生物_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "21 表里的生物",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文21表里的生物_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "21 表里的生物",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文21表里的生物_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "22 他们那时候多有趣啊",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文22他们那时候多有趣啊_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "22 他们那时候多有趣啊",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文22他们那时候多有趣啊_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "22 他们那时候多有趣啊",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文22他们那时候多有趣啊_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第七单元",
    "section": "22 他们那时候多有趣啊",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文22他们那时候多有趣啊_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "23 少年闰土",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文23少年闰土_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "23 少年闰土",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文23少年闰土_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "23 少年闰土",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文23少年闰土_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "23 少年闰土",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文23少年闰土_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "24 好的故事",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文24好的故事_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "24 好的故事",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文24好的故事_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "24 好的故事",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文24好的故事_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "24 好的故事",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文24好的故事_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "25 我的伯父鲁迅先生",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文25我的伯父鲁迅先生_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "25 我的伯父鲁迅先生",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文25我的伯父鲁迅先生_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "25 我的伯父鲁迅先生",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文25我的伯父鲁迅先生_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "25 我的伯父鲁迅先生",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文25我的伯父鲁迅先生_课外拓展"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "26 有的人——纪念鲁迅有感",
    "tag": "课前预习",
    "title": "人教小学语文6上_课文26有的人——纪念鲁迅有感_课前预习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "26 有的人——纪念鲁迅有感",
    "tag": "课堂学习",
    "title": "人教小学语文6上_课文26有的人——纪念鲁迅有感_课堂学习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "26 有的人——纪念鲁迅有感",
    "tag": "课后复习",
    "title": "人教小学语文6上_课文26有的人——纪念鲁迅有感_课后复习"
  },
  {
    "pack": "人教版-小学-语文-六年级-上学期-26版",
    "subject": "语文",
    "unit": "第八单元",
    "section": "26 有的人——纪念鲁迅有感",
    "tag": "课外拓展",
    "title": "人教小学语文6上_课文26有的人——纪念鲁迅有感_课外拓展"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "第一节 分数除法(一)",
    "tag": "【教材知识精讲】分数除法(一)",
    "title": "北师大小学数学6上新版_第一单元_分数除法(一)_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "第一节 分数除法(一)",
    "tag": "【教材习题精讲】分数除法(一)",
    "title": "北师大小学数学6上新版_第一单元_分数除法(一)_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "第一节 分数除法(一)",
    "tag": "【拓展提升】分数除法(一)",
    "title": "北师大小学数学6上新版_第一单元_分数除法(一)_拓展提升"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "第一节 分数除法(一)",
    "tag": "【新课标 新考法】分数除法(一)",
    "title": "北师大小学数学6上新版_第一单元_分数除法(一)_新考法"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "第二节 分数除法(二)",
    "tag": "【教材知识精讲】分数除法(二)",
    "title": "北师大小学数学6上新版_第一单元_分数除法(二)_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "第二节 分数除法(二)",
    "tag": "【教材习题精讲】分数除法(二)",
    "title": "北师大小学数学6上新版_第一单元_分数除法(二)_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "第二节 分数除法(二)",
    "tag": "【拓展提升】分数除法(二)",
    "title": "北师大小学数学6上新版_第一单元_分数除法(二)_拓展提升"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "第二节 分数除法(二)",
    "tag": "【新课标 新考法】分数除法(二)",
    "title": "北师大小学数学6上新版_第一单元_分数除法(二)_新考法"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "第三节 分数除法(三)",
    "tag": "【教材知识精讲】分数除法(三)",
    "title": "北师大小学数学6上新版_第一单元_分数除法(三)_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "第三节 分数除法(三)",
    "tag": "【教材习题精讲】分数除法(三)",
    "title": "北师大小学数学6上新版_第一单元_分数除法(三)_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "第三节 分数除法(三)",
    "tag": "【拓展提升】分数除法(三)",
    "title": "北师大小学数学6上新版_第一单元_分数除法(三)_拓展提升"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "第三节 分数除法(三)",
    "tag": "【新课标 新考法】分数除法(三)",
    "title": "北师大小学数学6上新版_第一单元_分数除法(三)_新考法"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "整理与复习",
    "tag": "【教材知识精讲】内容整理",
    "title": "北师大小学数学6上新版_第一单元_内容整理_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "整理与复习",
    "tag": "【教材习题精讲】内容整理",
    "title": "北师大小学数学6上新版_第一单元_内容整理_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "整理与复习",
    "tag": "【拓展提升】内容整理",
    "title": "北师大小学数学6上新版_第一单元_内容整理_拓展提升"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第一单元　分数除法",
    "section": "整理与复习",
    "tag": "【新课标 新考法】内容整理",
    "title": "北师大小学数学6上新版_第一单元_内容整理_新考法"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第一节 车轮为什么是圆的",
    "tag": "【教材知识精讲】车轮为什么是圆的",
    "title": "北师大小学数学6上新版_第二单元_车轮为什么是圆的_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第二节 圆的认识(一)",
    "tag": "【教材知识精讲】圆的认识(一)",
    "title": "北师大小学数学6上新版_第二单元_圆的认识(一)_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第二节 圆的认识(一)",
    "tag": "【教材习题精讲】圆的认识(一)",
    "title": "北师大小学数学6上新版_第二单元_圆的认识(一)_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第三节 圆的认识(二)",
    "tag": "【教材知识精讲】圆的认识(二)",
    "title": "北师大小学数学6上新版_第二单元_圆的认识(二)_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第三节 圆的认识(二)",
    "tag": "【教材习题精讲】圆的认识(二)",
    "title": "北师大小学数学6上新版_第二单元_圆的认识(二)_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第四节 修复铜镜",
    "tag": "【教材知识精讲】修复铜镜",
    "title": "北师大小学数学6上新版_第二单元_修复铜镜_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第四节 修复铜镜",
    "tag": "【教材习题精讲】修复铜镜",
    "title": "北师大小学数学6上新版_第二单元_修复铜镜_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第五节 欣赏与设计",
    "tag": "【教材知识精讲】欣赏与设计",
    "title": "北师大小学数学6上新版_第二单元_欣赏与设计_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第五节 欣赏与设计",
    "tag": "【教材习题精讲】欣赏与设计",
    "title": "北师大小学数学6上新版_第二单元_欣赏与设计_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第六节 圆的周长",
    "tag": "【教材知识精讲】圆的周长",
    "title": "北师大小学数学6上新版_第二单元_圆的周长_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第六节 圆的周长",
    "tag": "【教材习题精讲】圆的周长",
    "title": "北师大小学数学6上新版_第二单元_圆的周长_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第七节 圆周率的历史",
    "tag": "【教材知识精讲】圆周率的历史",
    "title": "北师大小学数学6上新版_第二单元_圆周率的历史_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第八节 圆的面积(一)",
    "tag": "【教材知识精讲】圆的面积(一)",
    "title": "北师大小学数学6上新版_第二单元_圆的面积(一)_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第八节 圆的面积(一)",
    "tag": "【教材习题精讲】圆的面积(一)",
    "title": "北师大小学数学6上新版_第二单元_圆的面积(一)_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第九节 圆的面积(二)",
    "tag": "【教材知识精讲】圆的面积(二)",
    "title": "北师大小学数学6上新版_第二单元_圆的面积(二)_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "第九节 圆的面积(二)",
    "tag": "【教材习题精讲】圆的面积(二)",
    "title": "北师大小学数学6上新版_第二单元_圆的面积(二)_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "整理与复习",
    "tag": "【教材知识精讲】内容整理",
    "title": "北师大小学数学6上新版_第二单元_内容整理_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-26版",
    "subject": "数学",
    "unit": "第二单元　圆",
    "section": "整理与复习",
    "tag": "【教材习题精讲】内容整理",
    "title": "北师大小学数学6上新版_第二单元_内容整理_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第一节 圆的认识(一)",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第一单元_圆的认识（一）_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第一节 圆的认识(一)",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第一单元_圆的认识（一）_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第一节 圆的认识(一)",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-1-1-圆的认识(一)(1)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第二节 圆的认识(二)",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第一单元_圆的认识（二）_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第二节 圆的认识(二)",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第一单元_圆的认识（二）_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第二节 圆的认识(二)",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-1-3-圆的认识(二)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第三节 欣赏与设计",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第一单元_欣赏与设计_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第三节 欣赏与设计",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第一单元_欣赏与设计_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第三节 欣赏与设计",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-1-4-欣赏与设计-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第四节 圆的周长",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第一单元_圆的周长_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第四节 圆的周长",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第一单元_圆的周长_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第四节 圆的周长",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-1-6-圆的周长(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第五节 圆的面积(一)",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第一单元_圆的面积（一）_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第五节 圆的面积(一)",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第一单元_圆的面积（一）_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第五节 圆的面积(一)",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-1-9-圆的面积(一)(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第六节 圆的面积(二)",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第一单元_圆的面积（二）_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第六节 圆的面积(二)",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第一单元_圆的面积（二）_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第六节 圆的面积(二)",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-1-11-圆的面积(二)(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第六节 圆的面积(二)",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第一单元_整理与复习_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第六节 圆的面积(二)",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第一单元_整理与复习_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第一单元　圆",
    "section": "第六节 圆的面积(二)",
    "tag": "名师带你学2",
    "title": "五三-北师大数学六上19版-1-12-练习课(第1～11课时)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第二单元　分数混合运算",
    "section": "第一节 分数混合运算(一)",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第二单元_分数混合运算（一）_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第二单元　分数混合运算",
    "section": "第一节 分数混合运算(一)",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第二单元_分数混合运算（一）_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第二单元　分数混合运算",
    "section": "第一节 分数混合运算(一)",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-2-2-分数混合运算(一)(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第二单元　分数混合运算",
    "section": "第二节 分数混合运算(二)",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第二单元_分数混合运算（二）_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第二单元　分数混合运算",
    "section": "第二节 分数混合运算(二)",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第二单元_分数混合运算（二）_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第二单元　分数混合运算",
    "section": "第二节 分数混合运算(二)",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-2-4-分数混合运算(二)(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第二单元　分数混合运算",
    "section": "第三节 分数混合运算(三)",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第二单元_分数混合运算（三）_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第二单元　分数混合运算",
    "section": "第三节 分数混合运算(三)",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第二单元_分数混合运算（三）_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第二单元　分数混合运算",
    "section": "第三节 分数混合运算(三)",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-2-6-分数混合运算(三)(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第二单元　分数混合运算",
    "section": "第三节 分数混合运算(三)",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第二单元_整理与复习_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第二单元　分数混合运算",
    "section": "第三节 分数混合运算(三)",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第二单元_整理与复习_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第二单元　分数混合运算",
    "section": "第三节 分数混合运算(三)",
    "tag": "名师带你学2",
    "title": "五三-北师大数学六上19版-2-7-练习课(第1～6课时)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第三单元　观察物体",
    "section": "第一节 搭积木比赛",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第三单元_搭积木比赛_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第三单元　观察物体",
    "section": "第一节 搭积木比赛",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第三单元_搭积木比赛_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第三单元　观察物体",
    "section": "第一节 搭积木比赛",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-3-1-搭积木比赛(1)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第三单元　观察物体",
    "section": "第二节 观察的范围",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第三单元_观察的范围_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第三单元　观察物体",
    "section": "第二节 观察的范围",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第三单元_观察的范围_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第三单元　观察物体",
    "section": "第二节 观察的范围",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-3-3-观察的范围-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第三单元　观察物体",
    "section": "第三节 天安门广场",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第三单元_天安门广场_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第三单元　观察物体",
    "section": "第三节 天安门广场",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第三单元_天安门广场_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第三单元　观察物体",
    "section": "第三节 天安门广场",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-3-4-天安门广场-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第三单元　观察物体",
    "section": "第三节 天安门广场",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第三单元_整理与复习_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第一节 百分数的认识",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第四单元_百分数的认识_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第一节 百分数的认识",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第四单元_百分数的认识_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第一节 百分数的认识",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-4-1-百分数的认识-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第二节 合格率",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第四单元_合格率_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第二节 合格率",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第四单元_合格率_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第二节 合格率",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-4-3-合格率(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第三节 营养含量",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第四单元_营养含量_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第三节 营养含量",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第四单元_营养含量_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第三节 营养含量",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-4-5-营养含量-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第四节 这月我当家",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第四单元_这月我当家_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第四节 这月我当家",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第四单元_这月我当家_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第四节 这月我当家",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-4-7-这月我当家(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第四节 这月我当家",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第四单元_整理与复习_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第四节 这月我当家",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第四单元_整理与复习_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第四单元　百分数",
    "section": "第四节 这月我当家",
    "tag": "名师带你学2",
    "title": "五三-北师大数学六上19版-4-8-练习课(第5～7课时)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第一节 扇形统计图",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第五单元_扇形统计图_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第一节 扇形统计图",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第五单元_扇形统计图_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第一节 扇形统计图",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-5-1-扇形统计图-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第二节 统计图的选择",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第五单元_统计图的选择_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第二节 统计图的选择",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第五单元_统计图的选择_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第二节 统计图的选择",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-5-2-统计图的选择-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第三节 身高的情况",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第五单元_身高的情况_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第三节 身高的情况",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第五单元_身高的情况_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第三节 身高的情况",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-5-4-身高的情况-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第四节 身高的变化",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第五单元_身高的变化_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第四节 身高的变化",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第五单元_身高的变化_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第四节 身高的变化",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-5-5-身高的变化-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第四节 身高的变化",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第五单元_整理与复习_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第四节 身高的变化",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第五单元_整理与复习_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第五单元　数据处理",
    "section": "第四节 身高的变化",
    "tag": "名师带你学2",
    "title": "五三-北师大数学六上19版-5-6-练习课(第4、5课时)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第六单元　比的认识",
    "section": "第一节 生活中的比",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第六单元_生活中的比_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第六单元　比的认识",
    "section": "第一节 生活中的比",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第六单元_生活中的比_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第六单元　比的认识",
    "section": "第一节 生活中的比",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-6-2-生活中的比(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第六单元　比的认识",
    "section": "第二节 比的简化",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第六单元_比的化简_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第六单元　比的认识",
    "section": "第二节 比的简化",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第六单元_比的化简_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第六单元　比的认识",
    "section": "第二节 比的简化",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-6-3-比的化简-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第六单元　比的认识",
    "section": "第三节 比的应用",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第六单元_比的应用_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第六单元　比的认识",
    "section": "第三节 比的应用",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第六单元_比的应用_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第六单元　比的认识",
    "section": "第三节 比的应用",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-6-6-比的应用(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第六单元　比的认识",
    "section": "第三节 比的应用",
    "tag": "教材知识精讲-1",
    "title": "北师大小学数学六上15版_第六单元_整理与复习_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第六单元　比的认识",
    "section": "第三节 比的应用",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第六单元_整理与复习_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第六单元　比的认识",
    "section": "第三节 比的应用",
    "tag": "名师带你学2",
    "title": "五三-北师大数学六上19版-6-7-练习课(第5、6课时)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "数学好玩",
    "section": "第一节 反弹高度",
    "tag": "教材知识精讲-2",
    "title": "数学-小学-图谱-球的反弹高度问题"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "数学好玩",
    "section": "第三节 比赛场次",
    "tag": "教材知识精讲-3",
    "title": "数学-小学-图谱-稍复杂的组合问题"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第一节 百分数的应用(一)",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第七单元_百分数的应用（一）_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第一节 百分数的应用(一)",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第七单元_百分数的应用（一）_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第一节 百分数的应用(一)",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-7-2-百分数的应用(一)(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第二节 百分数的应用(二)",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第七单元_百分数的应用（二）_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第二节 百分数的应用(二)",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第七单元_百分数的应用（二）_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第二节 百分数的应用(二)",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-7-4-百分数的应用(二)(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第三节 百分数的应用(三)",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第七单元_百分数的应用（三）_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第三节 百分数的应用(三)",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第七单元_百分数的应用（三）_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第三节 百分数的应用(三)",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-7-7-百分数的应用(三)(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第四节 百分数的应用(四)",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第七单元_百分数的应用（四）_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第四节 百分数的应用(四)",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第七单元_百分数的应用（四）_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第四节 百分数的应用(四)",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-7-8-百分数的应用(四)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第四节 百分数的应用(四)",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_第七单元_整理与复习_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第四节 百分数的应用(四)",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_第七单元_整理与复习_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "第七单元　百分数的应用",
    "section": "第四节 百分数的应用(四)",
    "tag": "名师带你学2",
    "title": "五三-北师大数学六上19版-7-9-练习课(第6～8课时)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "总复习",
    "section": "第一节 数与代数",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_总复习_数与代数_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "总复习",
    "section": "第一节 数与代数",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_总复习_数与代数_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "总复习",
    "section": "第一节 数与代数",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-8-2-数与代数(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "总复习",
    "section": "第二节 图形与几何",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_总复习_图形与几何_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "总复习",
    "section": "第二节 图形与几何",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_总复习_图形与几何_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "总复习",
    "section": "第二节 图形与几何",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-8-4-图形与几何(2)-试题01"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "总复习",
    "section": "第三节 统计与概率",
    "tag": "教材知识精讲",
    "title": "北师大小学数学六上15版_总复习_统计与概率_教材知识精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "总复习",
    "section": "第三节 统计与概率",
    "tag": "教材习题精讲",
    "title": "北师大小学数学六上15版_总复习_统计与概率_教材习题精讲"
  },
  {
    "pack": "北师大-小学-数学-六年级-上学期-15版",
    "subject": "数学",
    "unit": "总复习",
    "section": "第三节 统计与概率",
    "tag": "名师带你学1",
    "title": "五三-北师大数学六上19版-8-5-统计与概率-试题01"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-26版",
    "subject": "英语",
    "unit": "Unit 1 Why do people move to new places?",
    "section": "",
    "tag": "单元目标",
    "title": "沪教小学英语六上新版_Unit1_单元目标"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-26版",
    "subject": "英语",
    "unit": "Unit 1 Why do people move to new places?",
    "section": "",
    "tag": "单元导学",
    "title": "沪教小学英语六上新版_Unit1_单元导学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-26版",
    "subject": "英语",
    "unit": "Unit 1 Why do people move to new places?",
    "section": "",
    "tag": "快乐阅读",
    "title": "沪教小学英语六上新版_Unit1_快乐阅读"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-26版",
    "subject": "英语",
    "unit": "Unit 1 Why do people move to new places?",
    "section": "",
    "tag": "新课标•句型应用",
    "title": "沪教小学英语六上新版_Unit1_句型应用"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-26版",
    "subject": "英语",
    "unit": "Unit 1 Why do people move to new places?",
    "section": "",
    "tag": "精练听说",
    "title": "沪教小学英语六上新版_Unit1_精练听说"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-26版",
    "subject": "英语",
    "unit": "Unit 1 Why do people move to new places?",
    "section": "",
    "tag": "新课标•拓展阅读",
    "title": "沪教小学英语六上新版_Unit1_拓展阅读"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-26版",
    "subject": "英语",
    "unit": "Unit 1 Why do people move to new places?",
    "section": "",
    "tag": "单元巩固",
    "title": "沪教小学英语六上新版_Unit1_单元巩固"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-26版",
    "subject": "英语",
    "unit": "Unit 2 Why do we make art?",
    "section": "",
    "tag": "单元目标",
    "title": "沪教小学英语六上新版_Unit2_单元目标"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-26版",
    "subject": "英语",
    "unit": "Unit 2 Why do we make art?",
    "section": "",
    "tag": "单元导学",
    "title": "沪教小学英语六上新版_Unit2_单元导学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-26版",
    "subject": "英语",
    "unit": "Unit 2 Why do we make art?",
    "section": "",
    "tag": "快乐阅读",
    "title": "沪教小学英语六上新版_Unit2_快乐阅读"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-26版",
    "subject": "英语",
    "unit": "Unit 2 Why do we make art?",
    "section": "",
    "tag": "新课标•句型应用",
    "title": "沪教小学英语六上新版_Unit2_句型应用"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-26版",
    "subject": "英语",
    "unit": "Unit 2 Why do we make art?",
    "section": "",
    "tag": "精练听说",
    "title": "沪教小学英语六上新版_Unit2_精练听说"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-26版",
    "subject": "英语",
    "unit": "Unit 2 Why do we make art?",
    "section": "",
    "tag": "新课标•拓展阅读",
    "title": "沪教小学英语六上新版_Unit2_拓展阅读"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-26版",
    "subject": "英语",
    "unit": "Unit 2 Why do we make art?",
    "section": "",
    "tag": "单元巩固",
    "title": "沪教小学英语六上新版_Unit2_单元巩固"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "1  Growing up",
    "section": "",
    "tag": "单元目标导学",
    "title": "上海义务教育小学英语六上_Unit1_单元目标导学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "1  Growing up",
    "section": "",
    "tag": "单词快乐学",
    "title": "上海义务教育小学英语六上_Unit1_单词快乐学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "1  Growing up",
    "section": "",
    "tag": "课文轻松学",
    "title": "上海义务教育小学英语六上_Unit1_课文轻松学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "1  Growing up",
    "section": "",
    "tag": "阅读与写作",
    "title": "上海义务教育小学英语六上_Unit1_阅读与写作"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "1  Growing up",
    "section": "",
    "tag": "语音实验室",
    "title": "上海义务教育小学英语六上_Unit1_语音实验室"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "1  Growing up",
    "section": "",
    "tag": "同步基础练",
    "title": "上海义务教育小学英语六上_Unit1_同步基础练"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "2  My summer holiday",
    "section": "",
    "tag": "单元目标导学",
    "title": "上海义务教育小学英语六上_Unit2_单元目标导学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "2  My summer holiday",
    "section": "",
    "tag": "单词快乐学",
    "title": "上海义务教育小学英语六上_Unit2_单词快乐学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "2  My summer holiday",
    "section": "",
    "tag": "课文轻松学",
    "title": "上海义务教育小学英语六上_Unit2_课文轻松学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "2  My summer holiday",
    "section": "",
    "tag": "阅读与写作",
    "title": "上海义务教育小学英语六上_Unit2_阅读与写作"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "2  My summer holiday",
    "section": "",
    "tag": "语音实验室",
    "title": "上海义务教育小学英语六上_Unit2_语音实验室"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "2  My summer holiday",
    "section": "",
    "tag": "同步基础练",
    "title": "上海义务教育小学英语六上_Unit2_同步基础练"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "3  Healthy or unhealthy?",
    "section": "",
    "tag": "单元目标导学",
    "title": "上海义务教育小学英语六上_Unit3_单元目标导学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "3  Healthy or unhealthy?",
    "section": "",
    "tag": "单词快乐学",
    "title": "上海义务教育小学英语六上_Unit3_单词快乐学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "3  Healthy or unhealthy?",
    "section": "",
    "tag": "课文轻松学",
    "title": "上海义务教育小学英语六上_Unit3_课文轻松学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "3  Healthy or unhealthy?",
    "section": "",
    "tag": "阅读与写作",
    "title": "上海义务教育小学英语六上_Unit3_阅读与写作"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "3  Healthy or unhealthy?",
    "section": "",
    "tag": "语音实验室",
    "title": "上海义务教育小学英语六上_Unit3_语音实验室"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "3  Healthy or unhealthy?",
    "section": "",
    "tag": "同步基础练",
    "title": "上海义务教育小学英语六上_Unit3_同步基础练"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "Revision 1",
    "section": "",
    "tag": "复习与检测1",
    "title": "上海义务教育小学英语六上_Revision1"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "Project 1",
    "section": "",
    "tag": "Project1",
    "title": "上海义务教育小学英语六上_Project1"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "4  Our neighbours",
    "section": "",
    "tag": "单元目标导学",
    "title": "上海义务教育小学英语六上_Unit4_单元目标导学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "4  Our neighbours",
    "section": "",
    "tag": "单词快乐学",
    "title": "上海义务教育小学英语六上_Unit4_单词快乐学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "4  Our neighbours",
    "section": "",
    "tag": "课文轻松学",
    "title": "上海义务教育小学英语六上_Unit4_课文轻松学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "4  Our neighbours",
    "section": "",
    "tag": "阅读与写作",
    "title": "上海义务教育小学英语六上_Unit4_阅读与写作"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "4  Our neighbours",
    "section": "",
    "tag": "语音实验室",
    "title": "上海义务教育小学英语六上_Unit4_语音实验室"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "4  Our neighbours",
    "section": "",
    "tag": "同步基础练",
    "title": "上海义务教育小学英语六上_Unit4_同步基础练"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "5  Animals in danger",
    "section": "",
    "tag": "单元目标导学",
    "title": "上海义务教育小学英语六上_Unit5_单元目标导学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "5  Animals in danger",
    "section": "",
    "tag": "单词快乐学",
    "title": "上海义务教育小学英语六上_Unit5_单词快乐学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "5  Animals in danger",
    "section": "",
    "tag": "课文轻松学",
    "title": "上海义务教育小学英语六上_Unit5_课文轻松学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "5  Animals in danger",
    "section": "",
    "tag": "阅读与写作",
    "title": "上海义务教育小学英语六上_Unit5_阅读与写作"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "5  Animals in danger",
    "section": "",
    "tag": "语音实验室",
    "title": "上海义务教育小学英语六上_Unit5_语音实验室"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "5  Animals in danger",
    "section": "",
    "tag": "同步基础练",
    "title": "上海义务教育小学英语六上_Unit5_同步基础练"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "6  E-friends",
    "section": "",
    "tag": "单元目标导学",
    "title": "上海义务教育小学英语六上_Unit6_单元目标导学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "6  E-friends",
    "section": "",
    "tag": "单词快乐学",
    "title": "上海义务教育小学英语六上_Unit6_单词快乐学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "6  E-friends",
    "section": "",
    "tag": "课文轻松学",
    "title": "上海义务教育小学英语六上_Unit6_课文轻松学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "6  E-friends",
    "section": "",
    "tag": "阅读与写作",
    "title": "上海义务教育小学英语六上_Unit6_阅读与写作"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "6  E-friends",
    "section": "",
    "tag": "语音实验室",
    "title": "上海义务教育小学英语六上_Unit6_语音实验室"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "6  E-friends",
    "section": "",
    "tag": "同步基础练",
    "title": "上海义务教育小学英语六上_Unit6_同步基础练"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "Revision 2",
    "section": "",
    "tag": "复习与检测2",
    "title": "上海义务教育小学英语六上_Revision2"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "Project 2",
    "section": "",
    "tag": "Project2",
    "title": "上海义务教育小学英语六上_Project2"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "7  Seeing a film",
    "section": "",
    "tag": "单元目标导学",
    "title": "上海义务教育小学英语六上_Unit7_单元目标导学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "7  Seeing a film",
    "section": "",
    "tag": "单词快乐学",
    "title": "上海义务教育小学英语六上_Unit7_单词快乐学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "7  Seeing a film",
    "section": "",
    "tag": "课文轻松学",
    "title": "上海义务教育小学英语六上_Unit7_课文轻松学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "7  Seeing a film",
    "section": "",
    "tag": "阅读与写作",
    "title": "上海义务教育小学英语六上_Unit7_阅读与写作"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "7  Seeing a film",
    "section": "",
    "tag": "语音实验室",
    "title": "上海义务教育小学英语六上_Unit7_语音实验室"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "7  Seeing a film",
    "section": "",
    "tag": "同步基础练",
    "title": "上海义务教育小学英语六上_Unit7_同步基础练"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "8  Visiting museums",
    "section": "",
    "tag": "单元目标导学",
    "title": "上海义务教育小学英语六上_Unit8_单元目标导学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "8  Visiting museums",
    "section": "",
    "tag": "单词快乐学",
    "title": "上海义务教育小学英语六上_Unit8_单词快乐学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "8  Visiting museums",
    "section": "",
    "tag": "课文轻松学",
    "title": "上海义务教育小学英语六上_Unit8_课文轻松学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "8  Visiting museums",
    "section": "",
    "tag": "阅读与写作",
    "title": "上海义务教育小学英语六上_Unit8_阅读与写作"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "8  Visiting museums",
    "section": "",
    "tag": "语音实验室",
    "title": "上海义务教育小学英语六上_Unit8_语音实验室"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "8  Visiting museums",
    "section": "",
    "tag": "同步基础练",
    "title": "上海义务教育小学英语六上_Unit8_同步基础练"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "9  Great cities of the world",
    "section": "",
    "tag": "单元目标导学",
    "title": "上海义务教育小学英语六上_Unit9_单元目标导学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "9  Great cities of the world",
    "section": "",
    "tag": "单词快乐学",
    "title": "上海义务教育小学英语六上_Unit9_单词快乐学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "9  Great cities of the world",
    "section": "",
    "tag": "课文轻松学",
    "title": "上海义务教育小学英语六上_Unit9_课文轻松学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "9  Great cities of the world",
    "section": "",
    "tag": "阅读与写作",
    "title": "上海义务教育小学英语六上_Unit9_阅读与写作"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "9  Great cities of the world",
    "section": "",
    "tag": "语音实验室",
    "title": "上海义务教育小学英语六上_Unit9_语音实验室"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "9  Great cities of the world",
    "section": "",
    "tag": "同步基础练",
    "title": "上海义务教育小学英语六上_Unit9_同步基础练"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "Revision 3",
    "section": "",
    "tag": "复习与检测3",
    "title": "上海义务教育小学英语六上_Revision3"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "Project 3",
    "section": "",
    "tag": "Project3",
    "title": "上海义务教育小学英语六上_Project3"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "10  Air",
    "section": "",
    "tag": "单元目标导学",
    "title": "上海义务教育小学英语六上_Unit10_单元目标导学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "10  Air",
    "section": "",
    "tag": "单词快乐学",
    "title": "上海义务教育小学英语六上_Unit10_单词快乐学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "10  Air",
    "section": "",
    "tag": "课文轻松学",
    "title": "上海义务教育小学英语六上_Unit10_课文轻松学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "10  Air",
    "section": "",
    "tag": "阅读与写作",
    "title": "上海义务教育小学英语六上_Unit10_阅读与写作"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "10  Air",
    "section": "",
    "tag": "语音实验室",
    "title": "上海义务教育小学英语六上_Unit10_语音实验室"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "10  Air",
    "section": "",
    "tag": "同步基础练",
    "title": "上海义务教育小学英语六上_Unit10_同步基础练"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "11  Trees",
    "section": "",
    "tag": "单元目标导学",
    "title": "上海义务教育小学英语六上_Unit11_单元目标导学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "11  Trees",
    "section": "",
    "tag": "单词快乐学",
    "title": "上海义务教育小学英语六上_Unit11_单词快乐学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "11  Trees",
    "section": "",
    "tag": "课文轻松学",
    "title": "上海义务教育小学英语六上_Unit11_课文轻松学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "11  Trees",
    "section": "",
    "tag": "阅读与写作",
    "title": "上海义务教育小学英语六上_Unit11_阅读与写作"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "11  Trees",
    "section": "",
    "tag": "语音实验室",
    "title": "上海义务教育小学英语六上_Unit11_语音实验室"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "11  Trees",
    "section": "",
    "tag": "同步基础练",
    "title": "上海义务教育小学英语六上_Unit11_同步基础练"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "12  The Earth",
    "section": "",
    "tag": "单元目标导学",
    "title": "上海义务教育小学英语六上_Unit12_单元目标导学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "12  The Earth",
    "section": "",
    "tag": "单词快乐学",
    "title": "上海义务教育小学英语六上_Unit12_单词快乐学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "12  The Earth",
    "section": "",
    "tag": "课文轻松学",
    "title": "上海义务教育小学英语六上_Unit12_课文轻松学"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "12  The Earth",
    "section": "",
    "tag": "阅读与写作",
    "title": "上海义务教育小学英语六上_Unit12_阅读与写作"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "12  The Earth",
    "section": "",
    "tag": "语音实验室",
    "title": "上海义务教育小学英语六上_Unit12_语音实验室"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "12  The Earth",
    "section": "",
    "tag": "同步基础练",
    "title": "上海义务教育小学英语六上_Unit12_同步基础练"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "Revision 4",
    "section": "",
    "tag": "复习与检测4",
    "title": "上海义务教育小学英语六上_Revision4"
  },
  {
    "pack": "沪教版-小学-英语-六年级-上学期-14版",
    "subject": "英语",
    "unit": "Project 4",
    "section": "",
    "tag": "Project4",
    "title": "上海义务教育小学英语六上_Project4"
  }
];
